{
  "videos/tESoBGyK8Y0": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nThe video risk is low because the footage is a straightforward, first-person DIY demonstration of making a small wooden shield. The techniques described (cutting planks, using a wire wheel to distress grain) are standard hobby woodworking practices and are presented accurately. There are no signs the clip is AI-generated or deceptively stitched from unrelated sources; narration and visuals form a coherent, plausible step-by-step sequence.\n\nContext risk is low because the content does not rely on scientific claims, sensational statistics, or out-of-context studies. It’s entertainment/maker content intended to respond to viewer comments, and it contains no political, medical, or financial advice that would require external verification. Note that the channel overall may post other material (e.g., game mod/exploit clips) — treat those separately — but this specific video stands on its own as benign hobby content.\n\nPresentation risk is low: the creator uses common short-form tactics (hooks, bold overlays, upbeat music, rapid cuts) to keep viewers engaged, but these are appropriate for the genre and not used to push a hidden agenda or manipulate viewers with fear or false urgency. Basic safety practices appear to be observed in the workshop footage; still, viewers should follow normal workshop safety precautions if they attempt the project themselves.",
  "videos/yrE84rNQWM4": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nExplanation for how you got the video risk rating:\n- The clip is an entertainment-focused remix of a nursery rhyme with no factual claims, so it poses minimal risk of misinformation.  \n- The channel is an established comedian account with a large subscriber base and professional representation, which supports authenticity.  \n- The audio and performance characteristics are consistent with a human live/short-form performance (energetic voice, rhythmic timing, likely a streamer or stage clip). There are no obvious signs of synthetic voice, deepfake faces, or algorithmic generation.  \n- Possible minor concern: the short could be a repost or excerpt from a longer live show, but that does not meaningfully increase risk here.\n\nExplanation for context risk:\n- No scientific, medical, political, or financial claims are made, so there are no contextual facts to verify or take out of context.  \n- The only context that might matter is provenance (e.g., whether this is an original performance or a reposted clip). If provenance matters for rights or attribution, check original uploads or the creator’s channels.  \n- Small practical caveat: verify booking or payment requests via the agency’s official channels before sharing sensitive information.\n\nExplanation for presentation risk:\n- The video uses upbeat music, rapid rhythm, text overlays, and energetic delivery to maximize engagement. These are standard attention-grabbing techniques for comedy/music shorts and are not being used to manipulate viewers toward a harmful action or belief.  \n- There is no clickbait headline, fear-based framing, product promotion, or ideological messaging in the content.  \n- Overall presentation is entertainment-first and benign; viewers should only be mindful of standard social-media concerns (reposts, copyright, or confirming booking contacts).",
  "videos/KFmhUdbNY9A": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nExplanation for video risk rating:\n- The footage reads as a short scripted comedy skit with live actors, handheld camera work, and natural audio; there are no strong indicators this is AI-generated (no synthetic voices or clearly manipulated visuals).  \n- The clip does not stitch unrelated clips together to create a false narrative, nor does it make factual claims presented as truth. It’s intended as humor, so overall risk from deception is low.\n\nExplanation for context risk:\n- The content plays on a simple verbal mistake (the character saying \"Cadillac convertible\" instead of \"catalytic converter\") for comedic effect. This is clearly fictional and not presented as factual information or as a claim requiring outside context.  \n- There are no scientific, political, or medical claims taken out of context, so no deeper subject-matter vetting is needed.\n\nExplanation for presentation risk:\n- The video uses common comedy editing choices (text overlay framing the joke, rapid camera moves, silent beat/deadpan) to guide emotional response. These are standard engagement techniques rather than manipulative or fear-based tactics.  \n- No apparent commercial, ideological agenda or harmful call-to-action is present. The only potential minor confusion is the intentional misnaming that drives the joke, but it is clearly part of the skit.",
  "videos/Aca7q0LOpJ4": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nExplanation for video risk rating:\n- This appears to be genuine stand-up footage (live crowd, stage setup, audible audience reactions) rather than an AI-generated or deepfake clip. Editing uses standard quick cuts and text overlays common in comedy reels; nothing indicates deceptive stitching or fabricated speakers. There are no factual claims being made that would create a misinformation risk. The only clear promotional element is normal self-promotion for the comedian’s shows.\n\nExplanation for context risk:\n- The content is subjective observational comedy about Australia/New Zealand cultural stereotypes. Understanding the friendly rivalry between those countries is sufficient context; no scientific, medical, or political claims are presented or taken out of context. Potential for offense exists (insults/explicit language), but that is a performance choice rather than misinformation.\n\nExplanation for presentation risk:\n- The video is presented as a high-energy comedy clip with bold text overlays, quick edits, crowd audio, and a montage-style “outtakes” feel. These choices aim to maximize engagement but do not mislead about the nature of the content. Language is explicit and confrontational by design, which may amplify emotional reactions but does not constitute agenda-driven framing or fearmongering.",
  "videos/lPZhWKAzCwE": "Mismatch level: Medium\nVideo Risk: Medium\nContext Risk: Medium\nPresentation Risk: High\n\nVideo risk explanation:\nThe clip appears to be a genuine streamer/brand-produced short, not AI-generated. However, it presents unverified performance numbers (exit velocities) via on-screen overlays without showing measuring equipment or testing conditions. The footage and commentary are shaped to promote a specific bat/brand and may conflate a training aid with a game-legal bat. That combination of selective evidence and promotional intent makes the video moderately risky for misleading viewers about actual performance.\n\nContext risk explanation:\nCritical context is missing: there’s no visible radar/Trackman, no information about ball weight, the batter’s background, or whether the bat is a legal game bat or a specialized training device. League rules and independent test results are not referenced. Those omissions create a moderate risk that viewers—especially younger players—will draw incorrect conclusions about legality and real-world performance.\n\nPresentation risk explanation:\nThe video uses high-energy editing, dramatic sound (the “ping”), sensational text overlays (\"WHO TF IS APPROVING THESE BATS 😂\"), and excited commentary to create awe and urgency. Branding is visible, and the framing implies controversy (“unapproved”/too powerful) as a clickbait tactic. Those presentation techniques strongly push viewers toward an emotional response and potential purchase, so presentation risk is high.\n\nRecommendation: treat the clip as entertainment/marketing. Verify any surprising performance claims with independent tests and check league equipment rules before assuming the bat is game-legal or that the numbers reflect controlled measurement.",
  "videos/EaDxKdpvMhc": "Mismatch level: High\nVideo Risk: High\nContext Risk: High\nPresentation Risk: High\n\nThis video is AI-manipulated (cheapfake/deepfake) — the visuals appear to be real footage reused from a political event but the audio has been replaced or synthetically altered to put inflammatory, fabricated statements into the speaker’s mouth. The speech shown did not occur as presented, so the clip is a direct piece of misinformation and should not be treated as a genuine press statement.\n\nContext risk is high because the clip repurposes decontextualized footage to push an ideological narrative (anti-media, anti-education, and anti-LGBTQ+). It strings together common online grievances (seed oils, SSRIs, “perverts” in schools) in a way that mimics real political rhetoric but has no factual basis; viewers need official transcripts or reputable reporting to understand the true context. The channel’s profile (very small audience, clickbait titles, no reputable sourcing) further reduces any trustworthiness.\n\nPresentation uses clear manipulation techniques: shocking, derogatory language to provoke outrage; distorted/urgent background music and POV text to create an “underground” vibe; and a handle/branding that signals an ideological agenda. Those choices are intended to maximize engagement and emotional response rather than convey accurate information, making the clip dangerous to share without verification.",
  "videos/PtYllW0pQnI": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Medium\nPresentation Risk: Medium\n\nExplanation for how you got the video risk rating:\nThis is a straightforward commercial promo for an AI slide tool (Manus x Nano Banana Pro), not a deepfake or fully AI-generated synthetic person. The content is marketing copy with typical industry hyperbole — e.g., \"slides build themselves\" and \"zero effort\" — but those are advertising claims rather than demonstrably false factual assertions. There’s no evidence of harmful misinformation. The primary risk is commercial bias: the video’s goal is to sell/download the app.\n\nExplanation for context risk:\nImportant context is missing from the short promo: real-world performance, required user input, pricing details (the “zero add‑on fees” claim), and data/privacy practices. Viewers should check full demos, app-store reviews, and any paid-promotion/affiliate disclosures before relying on the product. If the tool is being presented as replacing human judgment (content accuracy or domain expertise), that claim is oversimplified and should be verified independently.\n\nExplanation for presentation risk:\nThe video uses upbeat music, fast cuts, attractive templates, and FOMO wording to create the impression of instant, flawless results. Shots of slides being populated are likely time-compressed or simulated, which can mislead expectations about speed and ease. These persuasive production techniques raise presentation risk to medium even though factual misstatements are minimal.",
  "videos/UM2zIdniuj0": "Mismatch level: Low\nVideo Risk: Medium\nContext Risk: Medium\nPresentation Risk: High\n\nVideo risk explanation:\n- The central claim (Harold Holt, Australia's 17th PM, disappeared while swimming in 1967 and was never found) is historically accurate, so the video is not spreading a fabricated core fact. However, the presentation is sensationalized to generate engagement and uses hyperbolic analogies (e.g., comparing 1960s Australian ministerial security to modern U.S. presidential protection) that mislead about the practical comparability. The channel metadata (one subscriber, new account, generic name, no provenance) is a red flag for low credibility and possible spam/throwaway behavior, which raises risk that future content may be misleading or promotional. The video itself does not show clear signs of being a synthetic deepfake or AI-generated speaker — it reads like short-form human-narrated, heavily edited content using memes and stock assets — but the low-trust channel increases overall risk.\n\nContext risk explanation:\n- Important historical context is downplayed or withheld to maximize shock: the likely drowning at Cheviot Beach, the official search and coroner's findings, and the norms of 1960s Australian security are not properly explained. Omitting that context encourages conspiracy framing and can leave viewers with an impression of mysterious foul play that the evidence does not support. Because the video simplifies a tragic event into a \"weird history\" hook, viewers should consult reputable sources (history texts, official inquiry reports, serious documentaries) to get the full context.\n\nPresentation risk explanation:\n- The video uses a clickbait, meme-heavy style: aggressive hook language, profanity, rapid edits, \"trollface\"/conspiracy memes and distorted imagery intended to provoke shock and dread rather than inform. That style actively manipulates emotions and can push viewers toward seeing the event as a conspiracy or unsolved mystery despite ordinary explanations. Combined with an untrustworthy channel profile, this presentation increases the chance of misinterpretation and sensational spread.\n\nBottom line: The factual nucleus is correct, but the channel is unverified and the presentation is sensational and manipulative. Treat the video with caution, do not rely on it as a sole source, and verify the history using reputable biographies, news archives, or official inquiry documents.",
  "videos/mRt8iy-bSsM": "Error: 'TRANSCRIPTION_URL'",
  "videos/6f8z9WFTipg": "Error: 'TRANSCRIPTION_URL'",
  "videos/-wnmwcQDf_k": "Error: 'TRANSCRIPTION_URL'",
  "videos/emKjoylTVmo": "Error: 'TRANSCRIPTION_URL'",
  "videos/vQN-McO9F1g": "Error: 'TRANSCRIPTION_URL'",
  "videos/1nMrY8nOlwo": "Error: 'TRANSCRIPTION_URL'",
  "videos/QZXuNFmhzQo": "Error: 'TRANSCRIPTION_URL'",
  "videos/4CUNcXqdk_0": "Error: 'TRANSCRIPTION_URL'",
  "videos/7mrAWsst140": "Error: 'TRANSCRIPTION_URL'",
  "videos/izcogZlhTqU": "Error: 'TRANSCRIPTION_URL'",
  "videos/49VvXN_4lZM": "Error: 'TRANSCRIPTION_URL'",
  "videos/42EOt4kd9D8": "Error: 'TRANSCRIPTION_URL'",
  "videos/qZF3KJWy8h4": "Error: 'TRANSCRIPTION_URL'",
  "videos/ef60uLieY9k": "Error: 'TRANSCRIPTION_URL'",
  "videos/TCLThj8uOdI": "Error: 'TRANSCRIPTION_URL'",
  "videos/gcK3arcM_68": "Error: 'TRANSCRIPTION_URL'",
  "videos/NBincymlXJE": "Error: 'TRANSCRIPTION_URL'",
  "videos/8sJtX6nzROY": "Error: 'TRANSCRIPTION_URL'",
  "videos/dUP5J77rXs0": "Error: 'TRANSCRIPTION_URL'",
  "videos/5fpWCnm0QZc": "Error: 'TRANSCRIPTION_URL'",
  "videos/lWPWZDmABpA": "Error: 'TRANSCRIPTION_URL'",
  "videos/YFFupdr7RDk": "Error: 'TRANSCRIPTION_URL'",
  "videos/w_NjR00ij2I": "Error: 'TRANSCRIPTION_URL'",
  "videos/TQjHhTl0fIA": "Error: 'TRANSCRIPTION_URL'",
  "videos/3wrV0dRkRmg": "Error: 'TRANSCRIPTION_URL'",
  "videos/VG929LIm5O0": "Error: 'TRANSCRIPTION_URL'",
  "videos/1syNAk3hteg": "Error: 'TRANSCRIPTION_URL'",
  "videos/cKGV7eZ5ewY": "Error: 'TRANSCRIPTION_URL'",
  "videos/UR-YOm6Ew4k": "Error: 'TRANSCRIPTION_URL'",
  "videos/zYJsH5im76k": "Error: 'TRANSCRIPTION_URL'",
  "videos/CL9ci_mnJzY": "Error: 'TRANSCRIPTION_URL'",
  "videos/onHQoBhnTn0": "Error: 'TRANSCRIPTION_URL'",
  "videos/eJqp4oipBuA": "Error: 'TRANSCRIPTION_URL'",
  "videos/k4pICPvHXiM": "Error: 'TRANSCRIPTION_URL'",
  "videos/58qHLE3JjbI": "Error: 'TRANSCRIPTION_URL'",
  "videos/sWDSaWV4XPk": "Error: 'TRANSCRIPTION_URL'"

}