{
  "videos/mhNQ8y5ud0A": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nThis video is highly unlikely to be AI-generated. The transcript of the video matches normal cooking-shot phrasing and step sequencing, and Google Gemini's analysis is highly likely to be true that the footage is a straightforward culinary demo rather than stitched or synthetically generated material. The information found on the channel page is highly likely to be true that this is an established cooking channel (253K subs, consistent recipe focus), which further reduces the likelihood of deceptive AI content.\n\nMisinformation is minimal and limited to marketing shorthand. Google Gemini's analysis is highly likely to be true that the \"two-ingredient\" framing is an oversimplification: the transcript explicitly mentions salt, so technically more than two ingredients are used. The \"no oil\" claim is also highly likely to be accurate according to Google Gemini's analysis, which notes visible rendering of chicken fat in the pan. There are no medical, political, or conspiratorial claims, and no evidence the video is pushing an ideological agenda.\n\nContext to keep in mind: the information found on the channel page is highly likely to be true that short-form clips from this channel sometimes omit details (safety, exact temps, internal doneness). Viewers should supply standard food-safety context (cook chicken to a safe internal temperature, adjust times for thickness/oven variance). The channel page also indicates external links that may be affiliate-backed; that is common practice and not necessarily deceptive.\n\nPresentation style and potential for misleading impression: Google Gemini's analysis is highly likely to be true that the video uses engagement techniques—curiosity hooks (\"dangerous\"), bold captions, rapid pacing—to drive clicks. That is normal for short cooking clips and represents low manipulation risk. The primary presentational mislead is the ingredient-count shorthand and hypey wording; otherwise the demo is clear and practically useful.",
  "videos/BUHFtSYQFE8": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Medium\n\nIt is highly likely that the transcript of the video shows a short, comedic anecdote about “small people” struggling with a hard scoop of ice cream; that content is clearly subjective and humorous rather than factual. It is highly likely that Google Gemini's analysis concluded the clip is intended as entertainment and that there are no serious misinformation claims in the excerpt. It is highly likely that the information found on the channel page indicates this is a fan-made highlights/shorts channel (unverified) that frequently repackages podcast clips. Taken together, the clip is very unlikely to be AI-generated and does not appear to promote an organized agenda or make dangerous factual claims — so Video Risk is low.\n\nThe Context Risk is low because the transcript and Google Gemini's analysis both portray the remark as an absurd, personal anecdote rather than a claim that requires scientific backing. However, the information found on the channel page warns that this channel often trims longer podcast episodes into short clips; that practice can sometimes remove surrounding context and produce misleading impressions in other cases. For this particular clip the meaning is obvious (a joke), but if you needed to rely on the speaker for a serious claim, you should view the full original episode before trusting it.\n\nPresentation Risk is medium because, while the content itself is harmless comedy (per the transcript and Google Gemini's analysis), the information found on the channel page shows patterns that raise presentation concerns: frequent short-form edits, bold captions, clickbait titling/emoji styling, and probable unlicensed reuse of other creators’ material. Those presentation choices aim to maximize engagement and can sometimes emphasize punchlines out of context or give a distorted impression of the source. There’s no apparent fear-mongering, scam, or coordinated disinformation here, but the channel’s editing and reuse practices justify a cautious viewing stance.",
  "videos/jf8k4PVYGZw": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Medium\n\nIt is highly likely that Google Gemini's analysis is correct that this is a real, physical craft reveal (not AI-generated)—the visual evidence and the transcript of the video support a tangible, finished crochet plushie. The transcript (the streamer’s hyperbolic reaction and the numeric claims: \"180 pounds,\" \"7 feet tall and 7 feet wide,\" \"10-pound wooden structure\") is highly likely to be accurate for what’s said on-screen, but Google Gemini's analysis also finds those specific weight/density claims are anecdotal and unverified on camera (no scale or technical teardown). Overall this yields a low video risk: the content is genuine entertainment, not AI fabrication, and any factual claims are plausible but not independently verified.\n\nIt is highly likely that the information found on the channel page is accurate: this is a long-standing, niche creator with a large catalog and low overall channel-level risk. Context that matters: the streamer’s persona is intentionally theatrical, so viewers unfamiliar with the channel might interpret shouting/overreaction literally. The only factual/contextual gap is the lack of independent verification of the stated weight and internal construction; if you need exact specs (for shipping, safety, or replication), treat the numeric claims as estimates and seek direct proof (weighing, materials list, or construction breakdown).\n\nThe transcript and Google Gemini's analysis jointly show typical short-form presentation tactics: loud, rapid editing and an exaggerated reaction to maximize engagement, plus a visible brand name for yarn that functions as soft promotion. Those presentation choices raise a medium presentation risk because of potential clickbait/exaggeration (e.g., rounding or inflating \"180 pounds\" for dramatic effect) and because brand mentions could be promotional even if no explicit sponsorship is shown. There is no evidence of ideological or political agenda, nor of harmful misinformation—only minor, unverified technical claims and standard attention-grabbing editing.",
  "videos/0HD5SLie5jE": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nThe video-risk rating comes from the fact that Google Gemini's analysis is highly likely to be true: it identifies the clip as a short-form promotional advertisement demonstrating Artlist’s AI Suite and notes the visible use of image-to-video and stylistic-filter effects. The transcript is highly likely to be true: the spoken lines are explicit marketing copy (“Artlist’s AI Suite… With all the leading AI models in one place”) and an obvious satirical punchline about “Ron’s business failed.” The information found on the channel page is highly likely to be true: this appears to be the official Artlist channel with a long standing presence and large audience. Together these support a Low video risk — the video showcases AI features and uses comedic hyperbole but does not appear to be a deceptive or covertly AI‑generated claim.\n\nContext risk explanation:\nGoogle Gemini's analysis is highly likely to be true in assessing intent: this is product marketing, not a news or scientific claim. The transcript’s promotional statements are broad marketing claims (for example, “all the leading AI models”) that should be verified against Artlist’s official docs, but they don’t constitute demonstrable falsehoods in the clip itself. The channel page information is highly likely to be true and consistent with an established brand, which reduces the likelihood of malicious context (scam, impersonation, or political/health misinformation). Overall context risk is Low, with the caveat that users should check licensing, pricing, and exact feature lists on Artlist’s site before acting.\n\nPresentation risk explanation:\nGoogle Gemini's analysis is highly likely to be true about presentation: the video uses rapid cuts, upbeat music, bold captions, and comedic exaggeration (the “Ron failed” gag) to persuade viewers. The transcript is highly likely to be true in showing explicit marketing language and a clear call-to-action tone. The information found on the channel page is highly likely to be true and indicates this is standard branded advertising. These presentation techniques are persuasive but typical for commercial ads and not covertly manipulative; therefore presentation risk is Low. Minor caveat: treat marketing superlatives as promotional copy rather than guaranteed technical claims.",
  "videos/yoU4DRa_2Hc": "Mismatch level: Medium\nVideo Risk: Medium\nContext Risk: Medium\nPresentation Risk: Medium\n\nAccording to the semantic analysis, which is highly likely to be true, the video correctly states that \"sushi-grade\" is not a regulated U.S. term and cites the FDA freezing guidance — but it oversimplifies how those rules apply in practice. The transcript of the video, which is highly likely to be true, shows a definitive \"Yes\" claim that Costco farmed Atlantic salmon can be eaten raw and relies on on-camera tasting (friends/subscribers) as evidence. The information found on the channel page, which is highly likely to be true, indicates this is an entertainment creator with a large audience and no obvious malicious intent.\n\nExplanation for how you got the video risk rating (is it AI generated, clips stitched together misleadingly, etc.)\n- Not AI-generated: the content shows live filming in a Costco food court, natural dialogue and social-proof shots; combined with the channel history, there's no sign this is synthetic or deceptively stitched AI content.  \n- Why Medium risk: factual elements (non-regulated \"sushi-grade\" term; FDA guidance about freezing to kill parasites) are true, but the video presents a broad, definitive recommendation for eating a specific retail salmon raw without documenting the supplier’s parasite-control practices or store handling. That omission raises a realistic chance viewers will apply the claim too broadly and encounter food-safety harm.\n\nExplanation for context risk (what context do we need to know to understand the video? Are there any scientific studies taken out of context, misrepresentation of facts, etc.)\n- Important missing context: the FDA exemption for some farmed salmon depends on producer controls and documentation that consumers cannot verify at the point of purchase; the video does not explain this.  \n- Handling and storage risks are not emphasized: safe raw consumption depends on proper processing, cold chain during transport, and cross-contamination controls at the retailer and at home — factors the transcript does not cover.  \n- Generalization risk: viewers might generalize to wild salmon or other species that are not covered by any exemption. Because of these omissions, the factual baseline is accurate but the practical guidance is incomplete — hence Medium context risk.\n\nExplanation for presentation risk (how is the video presented? Is there music that sets a specific mood, clickbait behavior, fear selling, etc.)\n- The video uses a high-energy hook, bold text overlays, upbeat music, and social-proof tasting clips (friends/subscribers) to build quick trust. Google Gemini's analysis, which is highly likely to be true, notes those engagement tactics compress nuance and can encourage viewers to accept the conclusion without reading the full FDA guidance.  \n- The creator appears entertainment-focused (information found on the channel page is highly likely to be true) and not pushing obvious paid links in this clip, but brand affinity (Kirkland shirt) and the casual, definitive tone make the recommendation feel authoritative even when important caveats are missing.\n\nBottom line: The video is not AI-generated and contains some accurate facts, but it oversimplifies the regulatory and food-safety context. That makes it moderately risky: acceptable as entertainment and general info, but viewers should not treat it as definitive food-safety advice — verify supplier/handling practices or consult FDA guidance before eating non–sushi-labeled fish raw.",
  "videos/fRiCaTnxJNg": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Medium\nPresentation Risk: Low\n\nExplanation for how you got the video risk rating (is it AI generated, clips stitched together misleadingly, etc.)\n- According to Google Gemini's analysis, this is a short, lighthearted celebrity clip (John Cena) taken from a longer interview and edited for snackable social media consumption. The transcript of the video shows clearly comedic, anecdotal lines (e.g., “food that will never go back” and “basement for when the apocalypse happens”), not factual medical or scientific claims. There is no strong evidence the clip is AI‑generated; the audio/visual cues described by Google Gemini are consistent with a real interview snippet. Overall, the content is entertainment-focused and the risk of direct harm or deliberate deception is low.\n\nExplanation for context risk (what context do we need to know to understand the video? Are there any scientific studies taken out of context, misrepresentation of facts, etc.)\n- The information found on the channel page indicates the channel is likely an aggregator that repurposes short celebrity/expert moments, often without full‑context links or source citations. That raises a moderate context risk: while this particular short is harmless and comedic, the channel’s pattern increases the chance that other clips could be presented out of context or oversimplified (especially for health/nutrition topics). For this video specifically, the transcript lines are personal opinion/hyperbole, not scientific claims, so the mismatch with facts is low—but viewers should keep in mind the likely lack of sourcing if they seek the original full interview or any factual follow‑up.\n\nExplanation for presentation risk (how is the video presented? Is there music that sets a specific mood, clickbait behavior, fear selling, etc.)\n- Google Gemini's analysis notes typical short‑form editing: quick cuts, centered text overlays, B‑roll, and social cues like laughter to emphasize the comedic tone. The presentation aims for entertainment engagement rather than persuasion or fear selling. There’s no explicit agenda, call to action, or misleading health directive in the transcript. Presentation risk is therefore low, though the fast, decontextualized format is designed to maximize clicks and attention rather than provide full context.",
  "videos/CoK_Kzq9Fkk": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Medium\nPresentation Risk: Medium\n\nThis video is very unlikely to be AI-generated. Google Gemini's analysis is highly likely to be true that the footage is a human-performed comedic reaction in the Uncle Roger persona (split-screen, rapid cuts, catchphrases), and the transcript of the video is highly likely to be accurate in capturing the reactor’s lines and tone (exaggerated disbelief about “three stick of butter,” comments about wasting food, etc.). The channel page info is highly likely to be accurate that this is the official Uncle Roger shorts channel, which further supports human authorship and brand-driven content.\n\nContains misinformation? Minimal. Google Gemini's analysis is highly likely to be true that the clip is opinionated satire rather than a factual cooking tutorial. There are no clear false factual claims presented as authoritative; the primary risk is viewers misreading comedic judgment as factual cooking advice. If you need reliable culinary guidance, consult professional cooking sources rather than this short.\n\nPromoting an agenda? No political or harmful agenda is evident. Google Gemini's analysis is highly likely to be true that the primary intent is entertainment and brand engagement. The information found on the channel page is highly likely to be true that the channel links to merch and the creator’s main channel—so the video also serves promotional/brand purposes (merch/mailing list links). Note the channel page info warns that shortened external links exist; verify any external store/payment links before entering personal data.\n\nWhy I rated the risks this way\n- Video Risk (Low): The content is a clear comedy/reaction short with no high-stakes claims. The transcript shows only subjective commentary. Google Gemini's analysis also rated misinformation risk low and potential harm low.\n- Context Risk (Medium): The main contextual hazard is misinterpretation. Google Gemini's analysis is highly likely to be true that the video frames a performative cooking clip as “wrong” for comedic effect; viewers who don’t recognize the satire could take the critique as definitive culinary advice.\n- Presentation Risk (Medium): The video uses rapid cuts, split-screen, bold overlay text (“How to cook perfect steak”), close-ups, and signature catchphrases (per Google Gemini's analysis), which are designed to drive an emotional response. That editing and clickbait-style framing increase the chance viewers adopt the reactor’s interpretation without nuance.\n\nBottom line: Treat this as entertainment/comedy (and brand promotion). It is not AI-generated, does not meaningfully spread factual misinformation, and does not push a harmful agenda — but don’t use it as authoritative cooking instruction, and be cautious with any shortened external links promoted on the channel.",
  "videos/q75dJ8wlqeg": "Mismatch level: Medium\nVideo Risk: Medium\nContext Risk: Low\nPresentation Risk: Medium\n\nThis video is highly unlikely to be AI-generated (the footage reads as actual street-prank material). It does not push a political or ideological agenda. There is a low but non-negligible chance it contains misleading elements—most likely a misrepresentation of how \"real\" or spontaneous the giveaway is (i.e., staged or using prop money).\n\nExplanation for how you got the video risk rating\nGoogle Gemini's analysis is highly likely to be true that this is a street-challenge/prank framed as a cash giveaway that actually involves heavy, lubricated objects and theatrical editing. The transcript backs up the “free money” hook and the reveal about heavy/epoxied objects. Because the video lacks verifiable close-ups of the bills and shows rapid edits and convenient framing of reactions, it is likely to include staged or selectively edited moments. Those factors create a medium video risk: entertainment rather than outright fraud, but potentially misleading about the authenticity or spontaneity of the interaction.\n\nExplanation for context risk\nThe information found on the channel page is highly likely to be true that this is a fan/reupload channel that transparently labels itself as not official. That lowers scam risk and reduces contextual danger. There are no scientific claims or policy arguments being presented that require outside expertise, so the contextual risk is low. The main contextual caveat viewers need is genre: this is a social-media prank/entertainment clip, not an objective demonstration or verified giveaway—treat it as spectacle.\n\nExplanation for presentation risk\nGoogle Gemini's analysis is highly likely to be true that the video uses a high-value hook (“real money”), suspenseful music, bold captions, and quick cuts to maximize engagement. The transcript shows the hook appears immediately. Those presentation choices are clickbait-style and emotionally persuasive, increasing the chance viewers accept the premise at face value. That creates a medium presentation risk: the format encourages belief in the “free money” narrative even when key verification (bill authenticity, uncut attempts) is missing."
}