{
  "videos/AVeuGFSSAxQ": "This video appears to be a short motivational clip posted by a recently created aggregator-style channel — treat it with caution.\n\nWhy it’s only moderately trustworthy\n- Format and content: The channel republishes short motivational snippets from well-known figures (Joe Rogan, David Goggins, Jay Shetty). Short clips often lack context and can easily misrepresent the speaker’s intent.\n- Authenticity risk: High chance of decontextualization or selective editing that changes meaning. There’s no transcription or source link shown here to verify the original.\n- No deepfake evidence: Nothing indicates fabricated audio/video here, but edited snippets can still be misleading.\n- Red flags about the channel: It joined recently but already has many uploads and large views (typical of clip/aggregation channels). Uses a bit.ly link (hides destination) and a generic Gmail business contact — both reduce transparency and may indicate affiliate/lead-capture behavior.\n- Legal/ethical concerns: Likely reposts third‑party content without clear attribution or permission, which raises copyright and attribution issues.\n\nWhat could be problematic\n- Misleading context: Quotes or lines may be clipped so they seem to say something different from the original interview or talk.\n- Hidden links: Shortened URLs may lead to monetization funnels, tracking, or unsafe pages — don’t click unless you verify the destination.\n- Low accountability: Generic contact info and lack of clear channel ownership make it hard to follow up or confirm sources.\n\nWhat to do\n- Don’t click bit.ly/shortened links unless you expand/verify them first.\n- Verify any striking quote or claim by finding the full original interview/podcast.\n- If origin matters, look for the original uploader or the full-length source (official channels, podcasts).\n- Avoid giving personal/business info to contacts from the channel until you confirm legitimacy.\n- Report content if you find it infringes copyright or clearly misrepresents the speaker.\n\nBottom line: OK for quick inspiration, but not a reliable source for factual or contextual claims — verify the original sources before trusting or sharing.",
  "videos/35KWWdck7zM": "This video appears to come from an entertainment/comedy brand aimed at first responders; the channel page shows promos, shorts, and likely staged interviews rather than news or documentary reporting.\n\nConcise trust assessment and potential problems:\n- Positive signals: active cross‑platform presence and a large audience — suggests a professional or networked operation rather than an anonymous one.\n- Rapid growth/volume concern: the channel joined in Mar 2024 but already has hundreds of videos and 30M+ views, which is consistent with rapid reposting or a republishing network. That can mean content is aggregated from other creators (credit/copyright issues) or is produced at scale with less editorial oversight.\n- Staged content risk: promos, shorts, and staged interviews can be presented as \"real\" when they're scripted or acted — viewers should not assume documentary-level accuracy or authenticity of events/claims.\n- Transaction risk: the channel runs ticket/tour promos. Any offers to buy tickets or services via their site or private DMs carry the usual scam risks (fake tickets, unsafe payment methods).\n- Content verification gap: there’s no transcript here, so I can’t assess specific factual claims or check for misinformation in the video itself.\n\nPractical cautions (if you interact or buy):\n- Verify tickets with major vendors or the venue box office; use the ticket vendor’s site or verified links.\n- Confirm the channel/site uses HTTPS and look for verified badges and consistent branding across official socials.\n- Avoid gift cards, wire transfers, crypto, or private‑DM payment requests.\n- Check comments, independent reviews, and whether the video appears elsewhere (to spot reposted UGC or misattribution).\n- If copyright or provenance matters, look for credits and original creator links.\n\nBottom line: Mostly likely legitimate entertainment content, but exercise standard caution — especially before buying tickets or sharing sensitive information.",
  "videos/8Y8qAyyOGK8": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/CWOqr0VKJiE": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/-7lpXSygrFA": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/xiAAfiI0JZ8": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/UlYbauIfG-s": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/fLcPPUtgHzo": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/NkVvORK7mtg": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/I_UabJmBLU0": "Error: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-5-mini in organization org-fHbmMH0DdiJeeJe7YsiH3v1y on requests per min (RPM): Limit 3, Used 3, Requested 1. Please try again in 20s. Visit https://platform.openai.com/account/rate-limits to learn more. You can increase your rate limit by adding a payment method to your account at https://platform.openai.com/account/billing.', 'type': 'requests', 'param': None, 'code': 'rate_limit_exceeded'}}",
  "videos/vmPv2DWa8Co": "This video appears generally trustworthy and low-risk but with some caveats.\n\nSummary\n- The channel is an established, high-quality cooking creator (large subscriber base, long history, clear creator identity, consistent recipe focus), which supports credibility for cooking instruction and recipes.\n- However, the creator has a commercial interest (branded product line). That can introduce bias or promotional framing in videos.\n\nWhat might be problematic\n- Sponsored or affiliate content: product placement or recommendations (Oath Oats or other items) may be present and could be presented with positive bias. Check for sponsorship/affiliate disclosures in the video description or on-screen.\n- Health/nutrition claims: recipes labeled “healthy” or implying medical/dietary benefits are not a substitute for professional advice. Specific nutrition claims should be verified against product labels or a qualified professional.\n- I couldn’t review the spoken content because the transcription is empty — so I can’t confirm whether this particular video contains any factual errors, omissions, or misleading statements.\n\nQuick checks you can do\n- Look in the video description and pinned comments for sponsorship/affiliate disclosures and product links.\n- Visit the creator’s official website and the product site to confirm contact info, ingredient lists, and independent reviews.\n- If a recipe makes medical or nutrition claims, verify with product labels or consult a nutritionist/physician.\n- For food-safety concerns, ensure the recipe gives safe cooking temperatures and allergy warnings before trying it.\n\nBottom line: Reliable for recipes and cooking guidance from a reputable creator, but be alert for promotional bias and unverified nutrition claims; verify disclosures and health-related statements.",
  "videos/Xs5OYKAmmDQ": "This video appears to be of mixed trustworthiness and has several potential problems viewers should watch for.\n\n- Why it has some credibility: the host is a real physician (Paul Saladino, MD) with a long-running, well‑viewed channel and practical topics (sauna, exercise, shopping tips) that can be useful.\n\n- Main problems and potential misrepresentations:\n  - Strong promotion of an extreme, niche diet (carnivore/“animal‑based”) with broad, absolute claims such as “meat heals” or “live to 120+” that conflict with mainstream nutrition evidence and appear to rely heavily on anecdotes rather than consensus research.\n  - Likely selective citation or misinterpretation of science to support the channel’s dietary agenda; anecdotes and personal optimization claims are often presented as generalizable evidence.\n  - Commercial conflicts of interest: the host sells supplements/food brands (Heart & Soil, Lineage Provisions) and promotes products on the channel, which can bias recommendations.\n  - Sensational headlines and overstatements about things like testosterone, longevity, or “cures” that understate risks, contra‑indications, and uncertainty.\n  - Because the transcription is empty, specific claims in this particular video can’t be independently verified here — so the above concerns are based on the channel’s pattern.\n\n- Practical advice for viewers:\n  - Treat the content as opinion/anecdote from an MD rather than definitive medical guidance.\n  - Cross‑check specific health claims against peer‑reviewed research and official guidelines (dietary guidelines, cardiology, nephrology, endocrinology as relevant).\n  - Be cautious before making major diet or supplement changes; discuss them with your own clinician and consider relevant labs and monitoring.\n  - Watch for undisclosed or frequent product ties when assessing recommendations.\n\nBottom line: usable for general tips and one physician’s perspective, but use caution — expect potential bias, selective evidence, and commercial influence.",
  "videos/GfBrUYmV7n4": "This video appears to come from an authentic Trex brand channel and is likely reliable for official product information and marketing material — but it’s primarily promotional, so treat claims with caution.\n\nWhy it’s reasonably trustworthy\n- Channel links to trex.com, has consistent branding, long history (joined 2009), many subscribers and videos — all signs of an official corporate channel.\n- Useful for product visuals, installation demonstrations, company specs and marketing tests.\n\nPotential problems or misrepresentations to watch for\n- Promotional bias: benefits will be emphasized and drawbacks downplayed or omitted.\n- “Tests” or comparisons in the video could be staged, run under selective conditions, or lack adequate sample sizes and controls.\n- Sustainability, recycled‑content, durability, and warranty claims may be simplified; percentages, testing methods, exclusions or conditions may be left out.\n- Testimonials and contractor features may be curated and not representative of typical customer experiences.\n- No transcript was provided here, so I can’t confirm specific statements; absence of evidence of independent verification is a limitation.\n\nPractical steps to verify anything important\n- Cross‑check technical and eco claims with Trex’s official product literature and warranty documents (read the fine print).\n- Look for independent testing and reviews (Consumer Reports, building trade publications, third‑party lab tests) and long‑term owner experiences.\n- If the video shows comparative tests, ask for details: test method, sample sizes, controls, and whether testing was independent.\n- Consult local contractors and installers about real‑world performance in your climate.\n\nBottom line: useful for marketing, visuals and company specs, but verify key durability, environmental, and warranty claims independently before making purchasing decisions.",
  "videos/k2Swy85Wf0k": "This video appears to come from a generally legitimate home‑cooking channel, but there are a few caveats to keep in mind.\n\nWhy it seems trustworthy\n- Channel has been active since 2019, ~91K subscribers, ~29.5M total views and a large catalog of videos/shorts — consistent creator presence that supports authenticity.\n- Content focuses on home cooking and healthy recipes and is cross‑posted to TikTok, which aligns with a typical recipe/food creator rather than a scammer.\n- No obvious scam signals in the provided data (no fundraising asks, crypto/financial schemes, suspicious external links, or impersonation signs).\n\nPotential problems / misrepresentations\n- The channel has a history of exaggerated diet/health claims in titles (examples: “You will eat this dessert and lose weight”, “I haven't eaten sugar for a year”). Those are medical or nutritional claims that can be misleading if taken as factual advice.\n- The transcription for this specific video is empty, so I cannot verify whether this particular video repeats similar unqualified health claims or provides supporting evidence.\n- Short-form videos often oversimplify results and lack context (portion sizes, calorie counts, study citations), which can mislead viewers about expected outcomes like weight loss.\n- The channel does not appear to be run by credentialed medical/nutrition professionals (based on the summary), so any strong health or medical advice should be treated cautiously.\n\nPractical guidance\n- Safe to use for recipe ideas and cooking technique demonstrations.\n- Do not rely on the video for medical or weight‑loss advice without checking reliable sources or consulting a healthcare/nutrition professional.\n- Look for supporting evidence in the video description or linked sources, check the creator’s stated qualifications, and read comments/feedback for practical user experiences.\n- If you have allergies, medical conditions, or specific dietary needs, verify ingredient suitability and portion/nutrition details elsewhere.\n\nBottom line: Low risk for scams and generally trustworthy as a cooking content creator, but moderate risk of misleading or exaggerated health/diet claims — treat those claims skeptically and verify with qualified sources.",
  "videos/kniPZknyHoU": "This video appears generally low-risk as a cooking/recipe clip from a prolific creator, but there are some issues to watch for.\n\nWhat supports trustworthiness\n- The channel is large and active (688 videos, ~91K subs, 29.5M views), which suggests a genuine creator rather than a throwaway scam account.  \n- No obvious payment links, storefronts, or fundraising were identified in the provided data.\n\nPossible problems / misrepresentations\n- Repeated unqualified health or diet claims in titles (examples: \"You will eat this dessert and lose weight\", \"I haven't eaten sugar for a year\") are a red flag. Those kinds of claims are often oversimplified, anecdotal, or misleading and can promote unsafe expectations about weight loss or nutrition.  \n- The content appears to be short-form and possibly repost-style, which can omit important context, ingredient amounts, or safety steps.  \n- No transcript or semantic analysis was available here, so I can’t verify whether those health claims are repeated in the video itself or are backed up by evidence. Also no credentials are shown that would support medical/nutritional advice.\n\nPractical advice\n- Safe to watch and try recipes for enjoyment, but do not accept strong medical, weight-loss, or nutrition claims at face value.  \n- Verify any health or diet claims with reliable sources (registered dietitians, healthcare providers, and reputable public-health websites such as NHS/CDC/WHO) before changing your diet.  \n- If a video promotes a product or asks for money, independently verify seller contact details and read external reviews before buying or sending money.  \n- Look for supporting details (ingredient lists, quantities, cooking times) and user comments or other videos for consistency; be wary if these are missing.  \n- If a video recommends extreme or restrictive diets, or claims fast/guaranteed weight loss, treat it as potentially harmful and consult a professional.\n\nBottom line: Mostly safe for recipe content, but exercise caution and don’t rely on the channel for medical or definitive nutrition advice.",
  "videos/x6tjSixRGyo": "This video appears generally low-risk but has several caveats you should watch for.\n\nProblems and potential misrepresentations\n- Rapidly high views despite the channel being new — content may be viral shorts, repurposed, or reused from other creators without clear attribution. That raises questions about originality and sourcing.\n- No creator background, no verification badge, and no listed contact/email — limited transparency about who’s behind the channel.\n- Health and “benefit tips” are advertised on the channel — treat any medical or nutrition claims as unverified and cross-check with reliable sources or a professional.\n- Shopping/unboxing content may include affiliate/referral links or third‑party storefronts. If the video asks you to buy something, verify the seller before paying and be cautious with payment/return policies.\n- Some videos claim “recipe recreation” from TV shows — possible reuse of copyrighted material or incomplete/incorrect attribution.\n\nWhat to do before trusting or acting on the content\n- Cross-check any health or nutrition advice with trusted medical/nutrition sources.\n- Inspect linked products/shops carefully (look for reviews, seller details, secure payment methods, no pressure to pay).\n- Check video comments, other videos on the channel, and the linked Instagram for creator history and consistency.\n- Use reverse video/image search or search for the claimed original source if you suspect the content was reused from elsewhere.\n- If attribution matters (e.g., you need an original source), look for explicit credits or contact the creator for clarification.\n\nBottom line: Not obviously dangerous or scammy from the summary, but exercise caution around health claims, purchases, and the originality/attribution of content.",
  "videos/4qSA3X2GeMo": "This video appears to come from a channel with moderately low trust for factual/news accuracy and several features that make its claims potentially problematic.\n\nWhy it's a concern\n- The channel is high-volume, algorithm-driven (≈1,002 videos since Jul 2022, lots of shorts). That format prioritizes engagement and speed over careful sourcing.\n- Niche: reaction/viral-crime content with sensational, emoji-heavy titles—this often leads to oversimplification, exaggeration, or clickbait.\n- Minimal channel description and no visible citation or sourcing practices, so claims are unlikely to be traceable to primary sources.\n- Reaction-format videos frequently misinterpret or decontextualize clips and can perpetuate unverified secondhand claims.\n- While no explicit scam links were noted in the metadata provided, limited contact/sourcing information makes accountability low.\n\nWhat kinds of misrepresentation to watch for\n- Misleading thumbnails/titles that overstate facts or imply certainty where none exists.\n- Cherry-picked or out-of-context footage that alters meaning.\n- Attribution errors (e.g., claiming a clip shows one event/person when it’s from elsewhere).\n- Simplified explanations of complicated legal/financial matters (e.g., “big money bank stories”) without evidence.\n\nWhat you should do\n- Treat the video as entertainment/aggregation, not verified reporting.\n- Before trusting serious claims, confirm with mainstream news outlets, official statements, court records, or reputable fact-checkers.\n- Check the video description and pinned comments for source links; if none, be skeptical.\n- If a visual claim matters, try reverse-image/video search or search for the original clip on primary publisher accounts.\n- Look for corroboration from multiple independent sources.\n\nNote: I can’t assess the specific factual accuracy of this particular video because the transcription was empty. The above judgement is based on the channel profile and format.",
  "videos/DTHwcJa86Vw": "This video appears generally trustworthy as casual lifestyle/fitness content, but there are a few caveats and potential problems to watch for.\n\nWhy it looks okay\n- The channel is established (since 2017, ~81K subscribers, ~71M views, 1,100+ videos) and focuses on short-form fitness, recipes and grocery hauls — practical, low‑risk topics rather than extreme or conspiratorial claims.\n- No obvious signs of scammy behavior or miracle‑cure clickbait are reported in the channel summary.\n\nWhat’s uncertain / potentially problematic\n- There is no transcription included here, so I can’t verify any specific claims made in this particular video. That makes it impossible to rule out misleading statements or omissions in the video itself.\n- The creator does not appear to present obvious medical or nutrition credentials. Health and dietary advice in such channels is often informal, anecdotal, or oversimplified and can be incomplete or not appropriate for everyone.\n- Short-form videos frequently oversimplify complex topics (e.g., “quick fixes” for weight loss, one-size-fits-all diet rules) or imply broader results from single anecdotes or before/after shots.\n- Potential undisclosed commercial influence: check the video description and pinned comments for sponsorships, affiliate links, or product placements that might bias recommendations.\n\nWhat to do if you watch it\n- Don’t treat the video as medical or personalized nutrition advice. Cross-check any medical, dietary, or safety claims with qualified sources (registered dietitian, physician, or peer-reviewed research).\n- Look for citations or links in the description and for explicit sponsor disclosures. If none are present but the video promotes products, treat recommendations with extra caution.\n- Scan other videos and the channel’s About page for creator credentials or patterns (e.g., repeated promotional posts, obvious staged comments).\n- Read viewer comments for recurring complaints or reports of misleading information, but treat comments cautiously (they can be biased).\n\nBottom line: Good for general inspiration, recipes, and workout ideas, but verify health or medical claims and check for sponsorships before following specific regimens or buying recommended products.",
  "videos/trOqP8hWHkg": "Error: 'OPENAI_API_KEY'",
  "videos/qeAJZX1vZfU": "Error: 'OPENAI_API_KEY'",
  "videos/AbQp4fPFbPA": "Error: 'OPENAI_API_KEY'",
  "videos/4Fd3P0qxDtA": "Error: 'OPENAI_API_KEY'",
  "videos/KdESv7HrMZ8": "Error: 'OPENAI_API_KEY'",
  "videos/dzKAmEvHCcg": "Error: 'OPENAI_API_KEY'",
  "videos/wSwQcw8kNR8": "Error: 'OPENAI_API_KEY'",
  "videos/wTNlJIVT5d4": "Error: 'OPENAI_API_KEY'",
  "videos/LQhoev_bW_k": "Error: 'OPENAI_API_KEY'",
  "videos/AEOkRt5Bnro": "Error: 'OPENAI_API_KEY'",
  "videos/ObEJCt2M2fM": "Error: 'OPENAI_API_KEY'",
  "videos/crOnCivSoWs": "Error: 'OPENAI_API_KEY'",
  "videos/DO6m8KDo-NY": "Error: 'OPENAI_API_KEY'",
  "videos/W4Yn7TA9oBs": "Error: 'OPENAI_API_KEY'",
  "videos/xJu-s0XOoXk": "Error: 'OPENAI_API_KEY'",
  "videos/UBBi0fiysNc": "Error: 'OPENAI_API_KEY'",
  "videos/rhl-GH1GQSQ": "Error: 'OPENAI_API_KEY'",
  "videos/z8jD7xFkluI": "Error: 'OPENAI_API_KEY'",
  "videos/J9O91kBWrmE": "Error: 'OPENAI_API_KEY'",
  "videos/956GkzimYMM": "Error: 'OPENAI_API_KEY'",
  "videos/iewNWn8Gpgo": "Error: 'OPENAI_API_KEY'",
  "videos/k91qqiZfUMA": "Error: 'OPENAI_API_KEY'",
  "videos/JZp-9p-ACQk": "Error: 'OPENAI_API_KEY'",
  "videos/wdWiKvJDDgE": "Error: 'OPENAI_API_KEY'",
  "videos/WqTOaGwbtrM": "Error: 'OPENAI_API_KEY'",
  "videos/flrL3xp7vJ4": "Error: 'OPENAI_API_KEY'",
  "videos/FryZO0BXQ9k": "Error: 'OPENAI_API_KEY'",
  "videos/X9aefHie9Vg": "Error: 'OPENAI_API_KEY'",
  "videos/7j-nxagnEu4": "Error: 'OPENAI_API_KEY'",
  "videos/BieFHOH_02g": "Error: 'OPENAI_API_KEY'",
  "videos/yTR8XyFnaH4": "Error: 'OPENAI_API_KEY'",
  "videos/QtogJv0VdM4": "Error: 'OPENAI_API_KEY'",
  "videos/LvK_Twa4GjY": "Error: 'OPENAI_API_KEY'",
  "videos/cj77ITUusa8": "Error: 'OPENAI_API_KEY'",
  "videos/Ce8RsLagP-U": "Error: 'OPENAI_API_KEY'",
  "videos/X9_vACSpitU": "Error: 'OPENAI_API_KEY'",
  "videos/fEH6AKpok4Q": "Error: 'OPENAI_API_KEY'",
  "videos/Oqyp_O61wio": "Error: 'OPENAI_API_KEY'",
  "videos/w2mBOCY7t5E": "Error: 'OPENAI_API_KEY'",
  "videos/9iaPSE89pDE": "Error: 'OPENAI_API_KEY'",
  "videos/rAO663d1N-Y": "Error: 'OPENAI_API_KEY'",
  "videos/HODbT7FxoWg": "Error: 'OPENAI_API_KEY'",
  "videos/YFFupdr7RDk": "Error: 'OPENAI_API_KEY'",
  "videos/9_jWdrhCeD0": "Error: 'OPENAI_API_KEY'",
  "videos/LoSuv11T-TI": "Error: 'OPENAI_API_KEY'",
  "videos/1iKnpNeZUCQ": "Error: 'OPENAI_API_KEY'",
  "videos/OYx09mflBjE": "Error: 'OPENAI_API_KEY'",
  "videos/7H7CkNdGDns": "Error: 'OPENAI_API_KEY'",
  "videos/CjGDOWrVvaw": "Error: 'OPENAI_API_KEY'",
  "videos/ioNeuyKr3hA": "Error: 'OPENAI_API_KEY'",
  "videos/jo5Lcyh4ofw": "Error: 'OPENAI_API_KEY'",
  "videos/yUrA3LZDBWA": "Error: 'OPENAI_API_KEY'",
  "videos/-OtRc0gG-RQ": "Error: 'OPENAI_API_KEY'",
  "videos/GxAI8vHuF-M": "Error: 'OPENAI_API_KEY'",
  "videos/RsZuwYDnPnk": "Error: 'OPENAI_API_KEY'",
  "videos/2DWpoGrhRhg": "Error: 'OPENAI_API_KEY'",
  "videos/9kfXt-oIKEU": "Error: 'OPENAI_API_KEY'",
  "videos/bVOukZ0-W-o": "Error: 'OPENAI_API_KEY'",
  "videos/wwSbW1iFyxQ": "Error: 'OPENAI_API_KEY'",
  "videos/r_mXsrEvQXw": "Error: 'OPENAI_API_KEY'",
  "videos/tQPgDxzdpxk": "Error: 'OPENAI_API_KEY'",
  "videos/q3eySvrbkIs": "Error: 'OPENAI_API_KEY'",
  "videos/SY5wL2EuLU8": "Error: 'OPENAI_API_KEY'",
  "videos/XqmDnDm2hfw": "Error: 'OPENAI_API_KEY'",
  "videos/W0EWhAoX6M8": "Error: 'OPENAI_API_KEY'",
  "videos/1glCDcF6_uY": "Error: 'OPENAI_API_KEY'",
  "videos/QXVmooDGuOE": "Error: 'OPENAI_API_KEY'",
  "videos/9OtKkYgFnfM": "Error: 'OPENAI_API_KEY'",
  "videos/eV4o8smAaHc": "Error: 'OPENAI_API_KEY'",
  "videos/qkfCxQH5O9I": "Error: 'OPENAI_API_KEY'",
  "videos/YNYxHu4MMas": "Error: 'OPENAI_API_KEY'",
  "videos/PtVR4r4_GmE": "Error: 'OPENAI_API_KEY'",
  "videos/gR6h6OEWINU": "Error: 'OPENAI_API_KEY'",
  "videos/-PBZfNdSo8U": "Error: 'OPENAI_API_KEY'",
  "videos/_hlOPnyphBg": "Error: 'OPENAI_API_KEY'",
  "videos/LcVMuP6WpRs": "Error: 'OPENAI_API_KEY'",
  "videos/qiKpI8KgA9c": "Error: 'OPENAI_API_KEY'",
  "videos/55RAA4t8N6k": "Error: 'OPENAI_API_KEY'",
  "videos/WVbhutDQCkg": "Error: 'OPENAI_API_KEY'",
  "videos/r4P3B4wsEN0": "Error: 'OPENAI_API_KEY'",
  "videos/WLPSX3jXOsw": "Error: 'OPENAI_API_KEY'",
  "videos/7W0QScOitzM": "Error: 'OPENAI_API_KEY'",
  "videos/qZF3KJWy8h4": "Error: 'OPENAI_API_KEY'",
  "videos/dQWe1jLteuM": "Error: 'OPENAI_API_KEY'",
  "videos/d7c-f_LFA3U": "Error: 'OPENAI_API_KEY'",
  "videos/7XLRQFk9jxc": "Error: 'OPENAI_API_KEY'",
  "videos/rTa_dYZhQrI": "Error: 'OPENAI_API_KEY'",
  "videos/eNzWAWN2hsM": "Error: 'OPENAI_API_KEY'",
  "videos/lWyLwcbNJcc": "Error: 'OPENAI_API_KEY'",
  "videos/MZz80B__o3M": "Error: 'OPENAI_API_KEY'",
  "videos/0v5_l0sUCUA": "Error: 'OPENAI_API_KEY'",
  "videos/SCNfvdHUrGY": "Error: 'OPENAI_API_KEY'",
  "videos/Bq4r5dL05DA": "Error: 'OPENAI_API_KEY'",
  "videos/b_uB7MV2jWo": "Error: 'OPENAI_API_KEY'",
  "videos/XJux0cCfYWA": "Error: 'OPENAI_API_KEY'",
  "videos/KcSYRyLtY5A": "Error: 'OPENAI_API_KEY'",
  "videos/miloyuZe3Jw": "Error: 'OPENAI_API_KEY'",
  "videos/K27L79mCsD4": "Error: 'OPENAI_API_KEY'",
  "videos/8WMyqJKRgzw": "Error: 'OPENAI_API_KEY'",
  "videos/S7SauT1CMfY": "Error: 'OPENAI_API_KEY'",
  "videos/Q0P0W5sL3Ys": "Error: 'OPENAI_API_KEY'",
  "videos/yjigLrN5O5U": "Error: 'OPENAI_API_KEY'",
  "videos/tCOhtN5dh6k": "Error: 'OPENAI_API_KEY'",
  "videos/jglKNwkocj0": "Error: 'OPENAI_API_KEY'",
  "videos/hIRIxBW_e14": "Error: 'OPENAI_API_KEY'",
  "videos/3y5Ot-3UaQE": "Error: 'OPENAI_API_KEY'",
  "videos/YHwKuX1jIkY": "Error: 'OPENAI_API_KEY'",
  "videos/m1-R0X8Z6js": "Error: 'OPENAI_API_KEY'",
  "videos/_lFeC93PAw4": "Error: 'OPENAI_API_KEY'",
  "videos/nUCpBx31oCI": "Error: 'OPENAI_API_KEY'",
  "videos/qZ_fzNIVc7E": "Error: 'OPENAI_API_KEY'",
  "videos/J4AC6TX2LiY": "Error: 'OPENAI_API_KEY'",
  "videos/4hx4aGDWmRM": "Error: 'OPENAI_API_KEY'",
  "videos/kCSfkg2qlXM": "Error: 'OPENAI_API_KEY'",
  "videos/ItcHpI5Tdg0": "Error: 'OPENAI_API_KEY'",
  "videos/2bgdr9LK5gI": "Error: 'OPENAI_API_KEY'",
  "videos/y1u8FqZH3EI": "Error: 'OPENAI_API_KEY'",
  "videos/2PdGLTUgudg": "Error: 'OPENAI_API_KEY'",
  "videos/qfe7DHWq09A": "Error: 'OPENAI_API_KEY'",
  "videos/LajnN2zOjHg": "Error: 'OPENAI_API_KEY'",
  "videos/e6IxCNYdUAw": "Error: 'OPENAI_API_KEY'",
  "videos/9bV2Iz3y7ec": "Error: 'OPENAI_API_KEY'",
  "videos/4FvLrlt4jSE": "Error: 'OPENAI_API_KEY'",
  "videos/tF-EAEJiPSY": "Error: 'OPENAI_API_KEY'",
  "videos/dOMAGdOu1xc": "Error: 'OPENAI_API_KEY'",
  "videos/oFRCpV6zYXc": "Error: 'OPENAI_API_KEY'",
  "videos/hwDfFX5W0-4": "Error: 'OPENAI_API_KEY'",
  "videos/9DxXDLhXnwU": "Error: 'OPENAI_API_KEY'",
  "videos/fn9ikVl7mvY": "Error: 'OPENAI_API_KEY'",
  "videos/DZgBv7sjnGw": "Error: 'OPENAI_API_KEY'",
  "videos/u3OvtdXGqUA": "Error: 'OPENAI_API_KEY'",
  "videos/dsCm-mt3WP8": "Error: 'OPENAI_API_KEY'",
  "videos/bxTYVmo2Sss": "Error: 'OPENAI_API_KEY'",
  "videos/yWVb7ClFeb4": "Error: 'OPENAI_API_KEY'",
  "videos/vfzPv1AYks4": "Error: 'OPENAI_API_KEY'",
  "videos/0hLhgBwizz8": "Error: 'OPENAI_API_KEY'",
  "videos/xPPuj2kCOYg": "Error: 'OPENAI_API_KEY'",
  "videos/6SZimNEa4Wk": "Error: 'OPENAI_API_KEY'",
  "videos/Zc-0PIaPp1I": "Error: 'OPENAI_API_KEY'",
  "videos/8yFTuxdONJM": "Error: 'OPENAI_API_KEY'",
  "videos/mtaROqfmz_c": "Error: 'OPENAI_API_KEY'",
  "videos/-L5UCdLu1GU": "Error: 'OPENAI_API_KEY'",
  "videos/OlBaHpmGUS0": "Error: 'OPENAI_API_KEY'",
  "videos/cw92E9CRnkA": "Error: 'OPENAI_API_KEY'",
  "videos/OJ2TXR-R-IM": "Error: 'OPENAI_API_KEY'",
  "videos/_Eo5qK_QED4": "Error: 'OPENAI_API_KEY'",
  "videos/hVo9A9cy7WI": "Error: 'OPENAI_API_KEY'",
  "videos/OpscQcvUVDQ": "Error: 'OPENAI_API_KEY'",
  "videos/PN-Ngza4SrU": "Error: 'OPENAI_API_KEY'",
  "videos/VNO7_Q261kc": "Error: 'OPENAI_API_KEY'",
  "videos/WfY676NG1YU": "Error: 'OPENAI_API_KEY'",
  "videos/pNEkuLVVGhg": "Error: 'OPENAI_API_KEY'",
  "videos/Dq3WG1aedvQ": "Error: 'OPENAI_API_KEY'",
  "videos/VxFzFgcr8K8": "Error: 'OPENAI_API_KEY'",
  "videos/fqCX9CT47SI": "Error: 'OPENAI_API_KEY'",
  "videos/gcfeWlFl8iw": "Error: 'OPENAI_API_KEY'",
  "videos/Mvuhiu1WKKQ": "Error: 'OPENAI_API_KEY'",
  "videos/NaR_czsGqKk": "Error: 'OPENAI_API_KEY'",
  "videos/aGubTnDW28Q": "Error: 'OPENAI_API_KEY'",
  "videos/ZQT6WvbGxy0": "Error: 'OPENAI_API_KEY'",
  "videos/f0TzHrH3mW8": "Error: 'OPENAI_API_KEY'",
  "videos/1AWaZv8q__I": "Error: 'OPENAI_API_KEY'",
  "videos/var7_ite5BM": "Error: 'OPENAI_API_KEY'",
  "videos/uGV2-8B9aFw": "Error: 'OPENAI_API_KEY'",
  "videos/AjB2qGvm03I": "Error: 'OPENAI_API_KEY'",
  "videos/bsl46vGpMNU": "Error: 'OPENAI_API_KEY'",
  "videos/aE7s363DfDM": "Error: 'OPENAI_API_KEY'",
  "videos/7oIg2g-C7sE": "Error: 'OPENAI_API_KEY'",
  "videos/7WigfzKjHIk": "Error: 'OPENAI_API_KEY'",
  "videos/XKv2lwpw34Y": "Error: 'OPENAI_API_KEY'",
  "videos/xSseVMPWAII": "Error: 'OPENAI_API_KEY'",
  "videos/S1EmW9q3AbY": "Error: 'OPENAI_API_KEY'",
  "videos/vW3zn55oSfw": "Error: 'OPENAI_API_KEY'",
  "videos/rVWVsUgjixY": "Error: 'OPENAI_API_KEY'",
  "videos/RwXJLAev6Sk": "Error: 'OPENAI_API_KEY'",
  "videos/hFpOeBxJPw4": "Error: 'OPENAI_API_KEY'",
  "videos/AdE8bD8i2-g": "Error: 'OPENAI_API_KEY'",
  "videos/b2mY3YO-thc": "Error: 'OPENAI_API_KEY'",
  "videos/D7zVjUwOdH0": "Error: 'OPENAI_API_KEY'",
  "videos/ExmNYHDXqWg": "Error: 'OPENAI_API_KEY'",
  "videos/iWSUMqipJcM": "Error: 'OPENAI_API_KEY'",
  "videos/AHF-26J8quk": "Error: 'OPENAI_API_KEY'",
  "videos/eR2WYV3TUpY": "Error: 'OPENAI_API_KEY'",
  "videos/SC8z2XqZt-E": "Error: 'OPENAI_API_KEY'",
  "videos/rs3F2hvJuFc": "Error: 'OPENAI_API_KEY'",
  "videos/Kw7Up5BpkW8": "Error: 'OPENAI_API_KEY'",
  "videos/igkILED2D7c": "Error: 'OPENAI_API_KEY'",
  "videos/W8aRQPP6f-M": "Error: 'OPENAI_API_KEY'",
  "videos/eTLoHS48p0k": "Error: 'OPENAI_API_KEY'",
  "videos/4pXZvPODC04": "Error: 'OPENAI_API_KEY'",
  "videos/3rXi-z-HjPo": "Error: 'OPENAI_API_KEY'",
  "videos/SS7PaMQ6nhg": "Error: 'OPENAI_API_KEY'",
  "videos/pqZeQq9lBUc": "Error: 'OPENAI_API_KEY'",
  "videos/i0zI6KGgRfg": "Error: 'OPENAI_API_KEY'",
  "videos/0W5bQP5Ns6U": "Error: 'OPENAI_API_KEY'",
  "videos/BLSXnvwJXEY": "Error: 'OPENAI_API_KEY'",
  "videos/8UUKhF7xk8c": "Error: 'OPENAI_API_KEY'",
  "videos/XpzG2YtePVw": "Error: 'OPENAI_API_KEY'",
  "videos/asDPe50jNVc": "Error: 'OPENAI_API_KEY'",
  "videos/x7SmoFqPNII": "Error: 'OPENAI_API_KEY'",
  "videos/is9JpCRnaEE": "Error: 'OPENAI_API_KEY'",
  "videos/-VYpRlBNYk8": "Error: 'OPENAI_API_KEY'",
  "videos/sI7RAvuanLU": "Error: 'OPENAI_API_KEY'",
  "videos/2vxjSaIqd8w": "Error: 'OPENAI_API_KEY'",
  "videos/ikGODG_BHU8": "Error: 'OPENAI_API_KEY'",
  "videos/rTB80XP7W0E": "Error: 'OPENAI_API_KEY'",
  "videos/dN3HSORhTEA": "Error: 'OPENAI_API_KEY'",
  "videos/poc5LhgGrZo": "Error: 'OPENAI_API_KEY'",
  "videos/sQKR-UBgNqI": "Error: 'OPENAI_API_KEY'",
  "videos/o5CsW2OFRc0": "Error: 'OPENAI_API_KEY'",
  "videos/ZikG3YpEb00": "Error: 'OPENAI_API_KEY'",
  "videos/KSR9EAWaivQ": "Error: 'OPENAI_API_KEY'",
  "videos/7iC4nE5wqeY": "Error: 'OPENAI_API_KEY'",
  "videos/yoB_jKQIuMo": "Error: 'OPENAI_API_KEY'",
  "videos/q0rYmFuhoTI": "Error: 'OPENAI_API_KEY'",
  "videos/l0F2uRinNpQ": "Error: 'OPENAI_API_KEY'",
  "videos/Rz_U7C0aqls": "Error: 'OPENAI_API_KEY'",
  "videos/Sx4eJ68p1KE": "Error: 'OPENAI_API_KEY'",
  "videos/CVkT1Jut6Jw": "Error: 'OPENAI_API_KEY'",
  "videos/MiX65uWm3Ws": "Error: 'OPENAI_API_KEY'",
  "videos/t8lKuunQw2A": "Error: 'OPENAI_API_KEY'",
  "videos/b5ifkUZdMcY": "Error: 'OPENAI_API_KEY'",
  "videos/3-i5tq5L7yk": "Error: 'OPENAI_API_KEY'",
  "videos/DDxINi2hhjU": "Error: 'OPENAI_API_KEY'",
  "videos/v4gkMfUlY18": "Error: 'OPENAI_API_KEY'",
  "videos/GBznR2G_A5E": "Error: 'OPENAI_API_KEY'",
  "videos/xo33c2otQUo": "Error: 'OPENAI_API_KEY'",
  "videos/Mn8V7ID7xEw": "Error: 'OPENAI_API_KEY'",
  "videos/zUK-4rqJMZY": "Error: 'OPENAI_API_KEY'",
  "videos/DqCjXljTg_k": "Error: 'OPENAI_API_KEY'",
  "videos/agFoyYVLwH4": "Error: 'OPENAI_API_KEY'",
  "videos/eDd0E68BONk": "Error: 'OPENAI_API_KEY'",
  "videos/dh5wWCVIEhk": "Error: 'OPENAI_API_KEY'",
  "videos/5PE2DRzDTYo": "Error: 'OPENAI_API_KEY'",
  "videos/R2-C4zLa8OU": "Error: 'OPENAI_API_KEY'",
  "videos/nzo8yKK3lAI": "Error: 'OPENAI_API_KEY'",
  "videos/WcLIHJcew8w": "Error: 'OPENAI_API_KEY'",
  "videos/Dy9qC347mHA": "Error: 'OPENAI_API_KEY'",
  "videos/tcTUqJ4I5I4": "Error: 'OPENAI_API_KEY'",
  "videos/FcW2JMA4dm4": "Error: 'OPENAI_API_KEY'",
  "videos/6r6ZCX1bllM": "Error: 'OPENAI_API_KEY'",
  "videos/U_czwkmIMDk": "Error: 'OPENAI_API_KEY'",
  "videos/IMKIVZaPjW0": "Error: 'OPENAI_API_KEY'",
  "videos/ynWJkHsY01o": "Error: 'OPENAI_API_KEY'",
  "videos/vJDcRsVl044": "This video appears to come from an account with very low transparency and should be treated as untrusted.\n\nWhy it’s problematic\n- The channel is new (joined Sep 2023) with ~40 subscribers but has no description, no videos listed, no keywords, no country, and no view or video counts. That lack of basic information is a major transparency red flag.\n- The transcription is empty, so there’s no content to evaluate. Without content, you can’t verify claims, expertise, or intent.\n- The channel summary explicitly marks it “Low trust / unverified,” and there’s no social proof (reviews, portfolio, verified website, LinkedIn, etc.). That makes it impossible to confirm legitimacy.\n- Potential misrepresentations or risks include pretending to be an established resume or career service, posting fake testimonials, offering services it can’t deliver, or using the channel to solicit payments, sensitive personal data, or phishing links.\n\nWhat you should do\n- Don’t share personal information, sensitive documents (like identity documents), or payment details with the channel.\n- Don’t pay for services or sign up through links from the channel until you can verify legitimacy.\n- Verify independently: look for an official website, business listings, LinkedIn for the owner, third-party reviews, or ask for verifiable work samples and references.\n- If you’re considering a payment, prefer traceable methods, ask for a contract, and consider an escrow or platform that offers buyer protection.\n- If you’ve already interacted and feel scammed, stop further contact, contact your bank or payment provider, change passwords if you shared any, and report the channel to YouTube.\n\nVerdict\n- Because there is no content to assess and the channel displays multiple transparency red flags, treat it as untrusted and proceed with caution. It may be harmless (an inactive placeholder or a nascent business), but the risk of scams or misrepresentation is significant until verified.",
  "videos/P8llJzuSc2Y": "This video appears to be primarily entertainment/comedy and is generally trustworthy as that type of content, but not a reliable source for factual or political information.\n\nWhy: the channel is established (active since 2010, ~573K subscribers, 1,000+ videos) and links to public social accounts, which are positive credibility signals. However, the content is described as stand‑up, podcasts and comedy, so segments may use satire, exaggeration, or opinionated framing that could be mistaken for factual claims.\n\nPotential problems to watch for:\n- Political or topical comments may contain unverified or exaggerated claims presented for humor rather than accuracy.\n- The ticket link goes to a third‑party site (punchup.live); verify the vendor and reviews before purchasing.\n- There is no transcript provided here, so I can’t check the specific wording for misleading statements, hate speech, or other issues in the actual video.\n\nRecommendations:\n- Treat factual or newsy claims as opinion until confirmed by independent, reliable sources.\n- Verify ticketing/payment pages before entering personal or payment information.\n- Check the video description, pinned comment, or the creator’s other platforms for clarifications or context.\n\nNo immediate signs of impersonation, obvious scams, or malicious links were found in the provided data.",
  "videos/PV5UJKeyVh0": "This video appears to be low-risk and generally trustworthy for entertainment/standup content, based on the channel-level information provided.\n\nWhy:\n- Channel has a long history (since 2011), large audience (336K subscribers, 127M views) and consistent comedy/standup content, which are positive signals.\n- Legit indicators such as a professional booking email (WME agency) and consistent branding reduce the chance of scammy behavior.\n- The channel’s pattern (clips/full bits, not clickbait formats) and the absence of known donation/crypto asks or obvious phishing reduce major red flags.\n\nPotential problems / caveats:\n- I could not analyze the specific video content because the transcription/semantic analysis is empty. This assessment is based on channel-level signals, not a line-by-line check of the video. If the video includes factual claims (medical, political, legal, etc.), those claims haven’t been evaluated here and should be verified from authoritative sources.\n- Always verify booking/payment requests through the listed agency contact (don’t rely on random DMs). Check the video description before clicking external links or purchasing tickets—affiliate links or third-party sellers can be legitimate but should be vetted.\n- If you’re asked for money or personal information, proceed with extra caution and confirm via official channels.\n\nBottom line: No obvious problems from the channel data; exercise normal caution around payments, external links, and any specific factual claims in the individual video.",
  "videos/2srpgjtE4fI": "This video appears authentic and comes from the official Saturday Night Live (SNL) YouTube channel, which strongly supports its legitimacy (large subscriber base, links to Peacock/NBC, consistent branding). There are no obvious scam indicators (no suspicious external links or fundraising asks).\n\nWhat to watch for:\n- Content type: It’s comedy/satire. That makes the video trustworthy as entertainment, not as a factual news source. Jokes, caricatures, and invented scenarios can be misleading if taken literally.\n- No transcript/semantic data provided here, so I can’t evaluate any specific claims or lines in the sketch. If the sketch asserts real-world facts (dates, statistics, claims about people/events), verify those with reputable news or primary sources before treating them as true.\n- Potential harms: satire can still spread misinformation if shared without context, and sketches may include offensive stereotypes or exaggerated portrayals of public figures. There’s no sign here of deepfakes or manipulated media, but that can’t be ruled out without seeing the video.\n\nBottom line: Safe to watch and follow for comedy clips. Don’t rely on the sketch for factual information — fact-check any real-world claims elsewhere before sharing them as truth.",
  "videos/O_jLoio1I24": "This video appears to come from a highly trustworthy source (the verified Tonight Show Starring Jimmy Fallon channel), so there’s little risk of scams or malicious intent from the uploader. \n\nPotential problems and caveats:\n- Not a news source: material is primarily comedy/entertainment. Jokes, exaggeration, parody, or scripted bits can be inaccurate or misleading if taken as factual.\n- Clips/edits: short excerpts may omit context and change the meaning of a segment.\n- Sponsorship/product placement: some segments may promote products or sponsors; check the description for disclosures.\n- Links in the description: shorteners (pck.tv, bit.ly) are likely official but should be verified before giving sensitive info or clicking.\n- Accessibility/verification: the transcription/captions appear to be empty, which reduces ability to verify quotes or check details quickly.\n- Comments: user comments can include misinformation or scam links; treat them cautiously.\n\nPractical suggestions: confirm any factual claims using reliable news sources, check the channel verification and full-episode context if needed, inspect/link preview the description URLs before clicking, and be cautious with claims presented as serious in a comedic context.",
  "videos/8oCrFnL5LuY": "This video appears to be entertainment/prank content from a well-established channel — but there are a few things to be careful about.\n\nKey points\n- Trust level: The channel is large and long-running, so it's legitimate as a creator account, and overall risk of deliberate factual misinformation is low. However, its content is primarily pranks/stunts and often clickbait-style, so reliability as a factual source is poor.\n- Likely staging/misrepresentation: Prank channels commonly stage or heavily edit events. A video can present a staged stunt as “real” (or leave viewers unclear), which is a form of misleading representation even if no malicious intent exists.\n- Safety concerns: Some past videos are age-restricted and involve risky scenarios (example: “Mexico Kidnapping PRANK”), which can normalize dangerous behavior or encourage imitation.\n- Disclosure issues: Paid promotions or staged elements may not be clearly labeled. That reduces transparency about sponsorships or whether events are real.\n- Privacy/security: The channel links to external communities (Discord) and personal socials. Avoid sharing personal or financial information there; invites can expose users to scams or doxxing risks.\n- No transcript available: Because the transcription is empty, I can’t assess the specific video content for additional problems (false claims, hate speech, illegal activity, etc.).\n\nRecommendations\n- Treat the video as entertainment/staged unless the creator explicitly discloses otherwise.\n- Don’t imitate stunts or risky pranks shown.\n- Don’t join external invites or share personal info via Discord/DMs linked from the channel.\n- Check for sponsor labels or disclaimers in the video description and comments; cross-check any noteworthy factual claims with reliable sources.\n- If content depicts or promotes illegal or harmful activity, consider reporting it to the platform.\n\nBottom line: Not obviously a misinformation or scam channel, but expect staged/sensational content, potential safety risks, and limited transparency — exercise caution and don’t treat the video as factual.",
  "videos/1GYVCvN1zVU": "This video appears to come from a mostly trustworthy, low‑risk channel but has a few caveats you should be aware of.\n\nSummary of trustworthiness\n- Channel credibility: Large, established creator (≈3.95M subscribers, thousands of videos, billions of views) that typically publishes career/business/economics/lifestyle content — generally educational/entertainment rather than malicious misinformation.\n- Transparency: The creator discloses sponsorships and uses affiliate links (e.g., Opera), so commercial motives are visible.\n- Risk profile: Low risk for scams or organized misinformation; low–medium risk for occasional inaccuracies, sensational framing, or oversimplified analysis.\n\nPotential problems specific to this video\n- I can’t review the video’s content or transcript (transcription empty), so I can’t check specific factual claims or identify any misrepresentations in this particular video.\n- Common issues to watch for on this channel type:\n  - Clickbaity or oversimplified headlines and framing that exaggerate or leave out important nuance.\n  - Individual factual or analytical claims (especially about economics, policy, or investments) that may lack full sourcing or context.\n  - Commercial bias where product recommendations or links are tied to sponsorships/affiliate commissions.\n\nWhat you can do to verify and protect yourself\n- Check the video description for source links or citations; verify key facts against reputable primary sources (news outlets, academic papers, official stats).\n- Treat any calls to buy products, sign up for services, or follow affiliate links as commercial promotions and consider alternatives.\n- Be cautious taking financial, legal, or medical advice from an explainer/entertainment channel—consult subject‑matter experts or official guidance for important decisions.\n- If the video makes a strong or surprising claim, look for corroboration from other reliable outlets before accepting it.\n\nBottom line: The channel is generally trustworthy, but because I can’t see the video content, check sources and be mindful of possible oversimplification or commercial bias in this specific video.",
  "videos/yplCqAeHKNo": "This video appears to come from a high‑volume, sensational storytelling/aggregate channel and should be treated as entertainment rather than reliable reporting.\n\nWhy it’s potentially problematic\n- The channel is a content‑farm/repurposing type (rapid growth, very high views, 1,601 videos since Jun 2024), which correlates with mass-produced, low‑verification content.  \n- Titles use anonymous, sensational first‑person anecdotes with no sources or verifiable details → high risk the stories are fabricated, exaggerated, or presented out of context.  \n- Channel metadata is minimal (one‑line description, no external links or transparent sourcing), so there’s little accountability or way to verify origin.  \n- Although no obvious phishing/scam links were noted in the provided data, the lack of sourcing and sensational framing still makes it unsafe to rely on for factual claims.\n\nWhat to watch out for\n- Misrepresentation: fictional or unverified anecdotes presented as true first‑person experiences.  \n- Clickbait framing that prioritizes shock/engagement over accuracy.  \n- Potential for emotional manipulation or spreading falsehoods if viewers share without checking.\n\nRecommendations\n- Treat the video as entertainment, not as factual reporting.  \n- Do not cite or rely on it for news, legal, medical, financial, or other important decisions.  \n- If a specific claim matters, verify independently: look for primary sources, check reputable news outlets, reverse‑search the story/title, and examine the video description/comments for links or timestamps.  \n- Prefer channels that provide verifiable sourcing, author transparency, and clear contact or external links.\n\nBottom line: Yes — there are problematic elements (high risk of unverified or fabricated content). Safe to watch for entertainment, but verify any factual claims before trusting or sharing.",
  "videos/3mIxKW-4IBI": "This video appears to be from an established comedy creator and is generally trustworthy as entertainment, but there are a few things to watch for.\n\nWhy it seems trustworthy\n- The channel has a long history (since 2011), 6.09M subscribers, ~3.6B views, and cross‑platform links — indicators of a legitimate, well‑known creator.\n- Channel content is primarily sketches/stand‑up/comedy, and there are no signs of coordinated misinformation or political disinformation activity in the channel metadata.\n\nPotential problems / cautions\n- Transcription is empty, so I cannot evaluate any specific factual claims or assertions made in this particular video. If the video makes factual claims, verify them with reliable sources — comedy often uses exaggeration, satire, or invented premises.\n- Some of the creator’s content is adult or sexually themed; videos may be age‑restricted or contain material some viewers find offensive.\n- External links for tickets, merch, or other purchases should be verified before paying: check for HTTPS, confirm the domain is official, and prefer established payment processors (PayPal/Stripe). Scams are uncommon but possible.\n- Business contact uses a generic Gmail address (TWallComedy@gmail.com). Not unusual for independent creators, but be cautious about sharing sensitive personal or financial information via such contacts.\n\nBottom line\nOverall low risk for misinformation or scams given the creator’s profile — appropriate to treat the video as entertainment. If the video contains factual claims, verify independently. Exercise normal caution when following external links, buying tickets/merch, or sharing sensitive information.",
  "videos/fJVJT2IOM2I": "This video appears low‑risk and generally trustworthy based on the channel profile, but with a few modest cautions.\n\nWhy it looks okay\n- The channel is long‑established (since 2012) with 4.28M subscribers and >2.1B views and a consistent cooking/recipe focus — indicators of a reliable creator in this niche.\n- Titles appear to be practical recipes/tips rather than medical, financial, or political claims, so there’s little reason to expect serious misinformation.\n\nPotential problems to watch for\n- No transcription was provided, so I can’t check spoken claims in the video itself. Shorts or viral clips often omit important safety details (exact temperatures, cook times, allergen warnings, cross‑contamination guidance) that matter for food safety.\n- External links (TikTok, Instagram, Substack, etc.) could contain sponsored content, affiliate offers, or paid products—verify disclosures before paying or providing personal info.\n- Even reputable food channels sometimes simplify or tweak steps for entertainment; measurements, cooking times, or technique details may be abbreviated or approximate.\n\nPractical checks you can do\n- Check the video description for full recipe details, safety notes, and sponsor disclosures.\n- Look for an official verification badge or link to the creator’s website/socials to confirm authenticity.\n- Scan comments for viewer corrections or safety flags.\n- If you have allergies, dietary restrictions, or need precise food‑safety guidance, consult a full recipe or trusted food‑safety source rather than a short clip.\n\nIf you want, paste the video title/URL or a transcript and I’ll do a closer check for any specific misleading or unsafe claims.",
  "videos/PqoK6IZn4aY": "This video appears to be low-trust for factual claims and more like sensational/entertainment content than verified reporting.\n\nKey concerns and potential problems:\n- Low transparency: the channel is new/small with no description, keywords, or location, which makes source credibility weak.\n- Sensational, short-form “expose” format: content focused on exposing cheaters/relationship drama is often performative or anecdotal, not independently verified. Clips can be heavily edited or presented out of context to maximize reactions.\n- Risk of harassment or privacy violations: these videos can target private individuals, encourage viewers to contact or shame people shown, or reveal personal details. That creates real risk of harassment and possible defamation.\n- Misleading accusations: viewers should not treat claims in the video as evidence. Anecdotes or allegations in such channels are frequently unverified and may be false or exaggerated.\n- No obvious financial scam now: the channel shows no links/fundraising in the provided info, but be cautious of future links, direct messages, or requests for money or personal information.\n\nWhat you should do:\n- Treat the video as entertainment unless you can confirm its claims from reputable, independent sources.\n- Do not contact, harass, or publish personal information about people shown. Avoid sharing the video if it targets private individuals.\n- Be skeptical of screenshots/short clips; look for original context or reliable reporting before believing or acting on serious allegations.\n- If you or someone you know is targeted, report the content to the platform and consider preserving evidence and seeking legal advice for defamation/doxxing if needed.\n- Watch for future attempts to solicit money or personal data; don’t click unknown links or respond to unsolicited DMs.\n\nSummary: Low trust for factual accuracy; likely entertainment/drama with possible risks of harassment, privacy invasion, and misleading claims. Verify independently before acting or sharing.",
  "videos/Q0LTwuxyQ7I": "This video appears to come from a generally trustworthy, low‑risk cooking/entertainment channel, but there are a few things to watch for.\n\n- Overall trust: The channel profile (large subscriber count, consistent recipe/entertainment content, no flagged medical/political claims) suggests it’s legitimate and not a likely source of deliberate misinformation or scams.\n- No transcription available: I can’t verify any specific statements from this particular video, so I’m relying on the channel-level assessment you provided.\n- Potential issues to be aware of:\n  - Sponsored content or affiliate links: Unboxing/prank/recommendation videos often include paid promotions. Check the video description for sponsorship disclosures before clicking links or buying products.\n  - Staged or exaggerated content: Entertainment channels sometimes stage reactions, overstate product performance, or use clickbait thumbnails/titles. Treat dramatic claims or “too good to be true” demos skeptically.\n  - Safety and practical accuracy: Recipe or DIY demonstrations may skip safety steps, timings, or ingredient details. Don’t rely on a single video for critical or hazardous procedures.\n- How to verify: look for clear sponsorship disclosures in the description, read viewer comments and creator replies, watch other videos from the channel for consistency, and consult independent product reviews or authoritative sources for health/safety questions.\n\nBottom line: No obvious red flags for misinformation or scams based on the channel summary, but exercise the normal precautions around sponsorships, staged content, and safety details.",
  "videos/NcsyD0dQ2-g": "This video appears to come from an established lifestyle/fitness channel that is generally okay for entertainment, recipes, and workout inspiration, but there are a few potentially problematic elements to be aware of.\n\nWhat’s trustworthy\n- The channel has an established track record and large audience, so its recipe and workout videos are likely experiential and produced for entertainment.  \n- Content labeled as meal preps and gym routines is fine as general inspiration.\n\nPotential problems / misrepresentations\n- Promotion of “peptides” (via a link labeled “Peptides, cookbook, meal plans”) is a red flag. Peptides and other performance‑enhancing substances are often unregulated, can be unsafe, and may be illegal without medical supervision. Any implication that these are safe, universally effective, or a simple shortcut is potentially misleading and risky.  \n- The buying link uses a short/redirect URL (link.me/…), which obscures the actual destination and increases the risk of scams or low‑quality products.  \n- There are no visible professional credentials on the channel page. Nutrition and medical claims appear to be anecdotal; presenting personal results as general medical advice would be misleading.  \n- Paid products (cookbooks, meal plans, affiliate offers) may be promoted; these often make exaggerated claims or lack scientific backing. Without evidence, pricing/benefit claims should be treated skeptically.  \n- I don’t have a transcript to check the video’s specific claims, so I can’t verify if any explicit medical, dosing, or safety claims are made in the video itself.\n\nPractical advice\n- Enjoy recipes and workouts for inspiration, but don’t treat fitness/nutrition tips as medical advice.  \n- Do not use peptides or other performance substances without consulting a qualified healthcare professional.  \n- Before buying: follow the redirect to see the actual seller, check reviews, refund policies, and payment/security; search for independent reviews of the product and seller.  \n- Look for citations, credentials, or links to scientific evidence if the video makes health claims.  \n- If the video recommends specific supplements, doses, or treatments, verify those recommendations with a clinician.\n\nBottom line: fine for entertainment and meal/workout ideas, but exercise caution around promoted products—especially peptides—and don’t rely on the channel for medical or professional nutrition guidance.",
  "videos/xJqCA_mAYEc": "This video appears to come from an aggregator-style channel and is fine for casual entertainment, but there are some issues to be aware of.\n\nWhy it’s not fully trustworthy\n- Reliability: Medium–low — the channel posts many short clips and is not an authoritative source.  \n- Misinformation risk: Low — the content is entertainment (kids/family clips), so it’s unlikely to contain serious factual errors.  \n- Transparency/copyright risk: Moderate — the channel description uses a generic fair‑use/legal statement but provides no verifiable licensing, creator credits, or contact info. The channel name and handle mismatch suggests a possible rebrand or account reuse. These are common signs of content aggregation or reposting without clear permission.  \n- Privacy concern: Moderate — frequent footage of children/minors may be posted without public consent; sharing or republishing such clips can raise privacy and ethical issues.\n\nPotential misrepresentations\n- The video or channel may imply original ownership or proper licensing when none is documented.  \n- Lack of credits can hide the original creator; clips may be reposts from other creators without attribution.\n\nWhat you can do\n- Treat the clip as casual entertainment, not a reliable source.  \n- Verify authenticity before sharing: check the video description for credits/links, reverse‑search the clip, and scan comments for original-creator claims.  \n- If you believe you own the footage or find unauthorized use, contact the channel or file a copyright/privacy complaint with YouTube.  \n- Be cautious about sharing identifiable children’s footage.\n\nBottom line: OK to watch for fun, but exercise caution about attribution, copyright, and minors’ privacy.",
  "videos/45fP4cFue2E": "This video appears low-risk for factual misinformation but has some potential issues you should be cautious about.\n\nWhy it's generally okay\n- The channel produces comedic skits/shorts about animals and games, not health, political, or technical claims, so likelihood of harmful misinformation is low.\n- Large audience and high view counts make it likely to be entertainment/viral content rather than an attempt to deceive about facts.\n\nPotential problems / misrepresentations\n- Clickbait: Titles/thumbnails common to short-form entertainment channels can exaggerate or mislead about what the clip actually shows.\n- Reused/repurposed content: Heavy reliance on short/skit formats increases the chance material was taken from other creators or edited from elsewhere without clear credit.\n- Commercial/contact risk: The listed business contact is a generic Gmail and there’s no verified badge or official website. That raises moderate risk if you plan to enter any commercial dealings (sponsorships, paid promotions, purchases).\n- Disclosure issues: Sponsorships, affiliate links, or paid placements may not be clearly disclosed in short-form descriptions.\n\nPractical advice\n- Don’t trust this channel for factual information; treat it as entertainment.\n- Before any business dealings: verify identity on linked social accounts, ask for verifiable proof of ownership/rights to content, insist on written contracts, and use secure/traceable payment methods or escrow.\n- Check the video description/comments for external links, sponsorship disclosures, or signs the clip was taken from elsewhere; avoid clicking unknown links.\n- If worried about content origin, run a reverse-video/image search or look for the same clip on other channels to see if it’s reused.\n\nOverall: Low misinformation risk but moderate caution advised for commercial interactions and potential clickbait or uncredited reused content.",
  "videos/giViESaOe3k": "This video appears mostly trustworthy but with a few minor cautions.\n\nSummary\n- Trust level: Mostly trustworthy / low risk for misinformation or scams. The channel is large and established (5.3M subs, ~2.8B views, many videos) and focuses on comedy/entertainment rather than health, finance, or other high-risk topics.\n- Transparency: The channel uses sponsor/partner tags (e.g., HelloFresh, Angi), which is a positive sign for disclosure.\n- Content check: No obvious misinformation or harmful claims in titles; transcript not available here, so I can’t assess the specific video content itself.\n\nPotential problems / things to watch for\n- External links: The channel includes a Google Forms merch survey (forms.gle). Google Forms can legitimately collect responses but can also be used to harvest personal data; do not provide sensitive or payment information through such forms unless you confirm they’re legitimate.\n- Contact email: The listed contact is a .biz address (brand@johnsonbrothers.biz). That could be legitimate, but unusual domains can be a red flag — verify before sending personal or payment details.\n- Impersonation risk: I don’t have confirmation of a verification badge from the info provided. For high-value transactions or personal data requests, cross-check the channel against other official social accounts or an official storefront.\n\nPractical recommendations\n- Don’t enter sensitive information or payment details into the Google Form. If they ask for money or bank/card info, refuse and report.\n- Verify merch or fundraising requests by looking for official store links (Shopify/Teespring/BigCartel with the creator’s branding) or confirmation across multiple official social accounts.\n- Inspect link destinations (hover or use a link scanner) before clicking and avoid downloading files from strangers.\n- If you need to be sure the channel is authentic, look for a verification checkmark and matching official profiles on Instagram/Twitter/TikTok, or check the About page for consistent contact info.\n\nBottom line: No clear signs of misinformation or scams from the channel/video metadata, but treat external links and unusual contact addresses with routine caution.",
  "videos/sAi7dKRx5K8": "This video appears overall trustworthy based on the channel: Eater is an established, professional food-media brand with high production standards and a low risk of deliberate misinformation. However, because the transcription and video content weren’t provided, I can’t evaluate this specific episode for inaccuracies or misleading claims. Potential issues to watch for:\n\n- Branded/sponsored content or affiliate links: The channel commonly includes sponsorships or affiliate links. Check the video description and on-screen disclosures to identify commercial intent that might bias recommendations.\n- Culinary or nutrition claims: Food, diet, or health-related statements may be simplified or not fully accurate. Verify any medical or nutritional claims with a qualified expert or reliable sources.\n- Recipe/safety details: If the video gives recipes or food-preparation advice, double-check measurements, cooking times, and food-safety guidance before following along.\n- Editing/omission risks: Like other produced segments, selective editing or emphasis can create misleading impressions (e.g., about a restaurant’s quality, a person’s comments, or cultural context).\n- Sponsored guest appearances or product placement: Guests or featured products may be compensated; that can affect how they’re presented.\n\nRecommendation: review the video description for sponsorship disclosures and links, cross-check any health/nutrition claims, and consult multiple sources if the topic has important consequences. Overall trustworthiness: high for general entertainment/food journalism, with the usual caveats about sponsorship and technical accuracy.",
  "videos/dGkY9EDZQec": "This video appears to come from a highly trustworthy source: an established nonprofit hospital (St. Jude) with a long history, verified social profiles/handle (@stjude), official links to stjude.org, large view counts, and consistent mission-driven content (research, patient stories, education).\n\nProblems to watch for\n- I can’t assess the video’s actual claims because the transcription/semantic analysis are empty, so I can’t confirm whether any specific statements in the video are misleading or incomplete.\n- Standard cautions still apply: medical content is informational—not personalized medical advice. Viewers should consult a healthcare professional for personal medical decisions.\n- Donation links can be spoofed. Always confirm donation links go directly to stjude.org before giving money.\n- Check for typical issues that can occur even on reputable channels: outdated information, lack of explicit disclosures about conflicts/sponsorship, sensational thumbnails or titles that oversimplify nuanced findings, or edited excerpts that change context.\n\nRecommended quick checks\n- Verify the channel is verified and the description links point to stjude.org.\n- Note the upload date and look for newer guidance or studies if the topic is clinical.\n- Cross-check any medical or research claims with peer-reviewed sources or official St. Jude pages.\n- If donating, use the main stjude.org site rather than third‑party links.\n\nBottom line: The channel is high trustworthiness, but because I don’t have the video transcript, you should verify specific claims and donation links and treat medical content as informational only.",
  "videos/G7opntYTlAg": "This video appears to come from a generally legitimate home/food creator and is likely fine for recipe and cooking content, but there are a few things to watch for.\n\nWhat’s trustworthy\n- Channel has longevity (since 2016), a substantial subscriber/view history, and consistent recipe content — typical signs of a genuine creator.\n- No obvious scam signals (no fundraising/“get rich” claims or phishing behavior reported).\n\nPotential problems / misrepresentations\n- Health and diet claims: the channel frequently uses diet labels (Paleo, Keto, Whole30). Tips framed as nutrition or medical advice can be oversimplified or not evidence-based. Treat any claims about weight loss, disease prevention, or broad health benefits with caution.\n- Skincare language: a mentioned video titled “detox your skin” uses a common but scientifically misleading phrase — skin generally doesn’t “detox” in the way such language implies. That kind of claim is a red flag for pseudoscientific advice.\n- Transparency: the supplied channel metadata (description/keywords/country) is empty, which reduces context about the creator’s background or credentials.\n- Missing transcript: because the video transcription is empty here, I can’t verify exact claims or wording — so it’s possible specific statements could be misleading even if the channel overall is reliable.\n\nPractical advice\n- Good to follow for recipes and cooking technique. For nutrition, medical, or skincare recommendations: verify with reputable sources (registered dietitians, peer‑reviewed literature, government health sites) or consult a healthcare professional before making changes.\n- Check the video description and pinned comments for sources or qualifications, and look at viewer comments for any reported inaccuracies.\n- Be cautious about food-safety or allergy information in recipe videos (cooking temperatures, preserving/canning, fermenting) and verify when in doubt.\n\nBottom line: generally trustworthy for cooking content, but treat health/diet/skin claims skeptically and seek independent verification.",
  "videos/ITxzpqpMZAc": "This video appears generally trustworthy as a personal triathlon / self-improvement vlog, but there are some caveats viewers should be aware of.\n\nWhat looks good\n- Channel age, subscriber count, view history and consistent personal-brand content are positive trust signals.\n- No obvious scam or impersonation indicators in the provided channel info.\n\nPossible problems or misrepresentations\n- Not a credentialed medical source: fitness, nutrition, injury prevention and mental-health claims should not be treated as professional advice.\n- Anecdote vs. evidence: personal results (training progress, weight loss, mental benefits) may be presented as broadly applicable even though they’re individual experiences, not controlled evidence.\n- Risky challenges: content about “75 Hard” or other extreme regimens can encourage unsafe practices if copied without professional clearance (overtraining, inadequate recovery, extreme dieting).\n- Paid/affiliate content: Linktree and similar links often contain affiliate or sponsored links; there may be commercial interests that influence recommendations. Sponsorships or monetary incentives may not always be obvious in the video itself.\n- Omitted risks: vlogs often omit negative outcomes or injuries and may understate risks of following a specific program.\n\nPractical advice for viewers\n- Treat the video as motivation and personal experience, not medical or professional guidance.\n- If considering a major change (new training load, diet, supplements or an extreme challenge), check the evidence and consult a qualified coach, doctor, or dietitian.\n- Check the video description and Linktree for sponsorship disclosures and product links before making purchases.\n- Cross-check any specific factual claims (health statistics, performance advice) with reputable sources.\n\nLimitations\n- No transcription or video content was provided, so I can’t point to specific statements in this particular video that are incorrect or misleading—these are general cautions based on the channel summary.\n\nBottom line: Useful for motivation and experiential insight, but verify health/performance claims and be cautious about following extreme programs or buying products promoted through affiliate links.",
  "videos/i2DZDr7yC_U": "This video appears generally trustworthy based on the channel profile, but I can’t fully verify the specific video's content because there’s no transcription available.\n\nWhy it seems trustworthy\n- The channel is well-established (joined 2012, ~4.28M subscribers, 2.19B views, 616 videos) and focuses on cooking/food content, which fits the observed topics and reduces the likelihood of deliberate misinformation.\n- No obvious red flags in the provided summary (no visible fundraising/paypal links, multiple platform presences are normal).\n\nPotential problems to watch for\n- I can’t confirm what this particular video claims — without a transcript or viewing the video, it could still contain omissions or minor misrepresentations (e.g., skipping safety steps, leaving out exact measurements/times, simplifying techniques, or using click‑bait wording in titles/thumbnails).\n- Sponsored content or affiliate links may appear in the description or external sites (Substack, TikTok, Instagram); check disclosures before paying or following paid offers.\n- If the video makes health or nutrition claims, those should be independently verified with reliable sources—cooking channels sometimes overstate benefits.\n- Allergens and kitchen safety: creators sometimes omit warnings; verify ingredients and follow safe food handling.\n\nWhat I recommend\n- Inspect the video description for ingredient lists, full instructions, and sponsorship disclosures.\n- Scan comments for viewer corrections or safety notes.\n- Don’t rely on any paid offers linked off‑site without verifying them.\n- Cross‑check any medical/nutritional claims with authoritative sources.\n\nBottom line: The channel looks low‑risk and normally reliable for recipes, but confirm specifics in the video description/comments and be cautious about sponsorships, omitted safety steps, allergy info, or health claims.",
  "videos/K3-3UNMcQXg": "This video appears to come from a faith-driven evangelism/apologetics channel that is legitimate as a devotional/outreach source but not a reliable neutral source for contested facts, interfaith analysis, or politics.\n\nWhat’s problematic or worth cautioning\n- Bias and potential misrepresentation: The channel’s mission is evangelism, so videos—especially short clips—can oversimplify or present one-sided portrayals of other religions or historical/political issues (e.g., titles like “The Truth About Islam” signal likely bias).\n- Lack of sourcing and credentials: Channel info shows no academic credentials or cited sources; factual claims should be independently verified.\n- Short-form editing risks: Clips often remove context and nuance, increasing the chance of cherry-picking quotes or misrepresenting opponents’ views.\n- Monetization risks: External links to shops/memberships mean you should check site security (HTTPS), reviews, and refund policies before buying or subscribing.\n- No transcript provided: Without the transcript, specific claims in the video can’t be checked here—treat statements as opinion unless supported by reputable sources.\n\nWhat to do if you watch it\n- Treat the content as devotional/persuasive rather than objective reporting.\n- For historical, theological, or political claims, cross-check with academic or reputable third-party sources.\n- Look for the full-length source or references in the video description; watch longer-format content from the same channel (if available) for context.\n- Inspect external links and seller reviews before purchasing or joining memberships.\n- Be cautious of emotionally charged or absolute language and check for out-of-context excerpts.\n\nBottom line: acceptable for devotional/apologetic perspective, but approach factual or comparative claims skeptically and verify independently.",
  "videos/EU5LKZVPcnk": "This video appears low-risk and generally trustworthy based on the channel information provided.\n\nWhy: the channel is a Miami‑based Christian music band with Spanish/English content, large and consistent metrics (1.14M subs, ~1B views, 1,344 videos), and the content matches the stated description (official music videos, lyric videos, inspirational shorts). No obvious red flags for scams or misinformation were found in the summary.\n\nCaveats and things to watch for\n- I don’t have a transcription or the video content itself, so I couldn’t inspect the video for specific false claims or problematic statements. If the video contains factual claims (medical, political, or otherwise), those should be checked independently.\n- Shorts on the channel use emotional/clickbaity captions — common for engagement but sometimes misleading about what the clip actually shows.\n- The profile links to a linktr.ee page. Treat any external links (especially donation/fundraising/payment pages) with routine caution: verify destination, look for HTTPS and known payment processors, and avoid giving personal or financial info unless you confirm authenticity.\n- “Official” status should be confirmed if that matters to you: check for verified badges and corroborate via the band’s official website or their verified social profiles to rule out impersonation.\n\nQuick verification steps\n- Look for the platform’s verification mark and the same content/accounts on the band’s official site or other verified social accounts.\n- Scan comments for community reports of scams or copied content.\n- Inspect any payment or donation links carefully before transacting.\n\nBottom line: based on the channel summary this looks legitimate and low risk, but because the video content itself wasn’t available for review, apply normal verification steps (especially before clicking external links or donating).",
  "videos/tPRQdgzRBOs": "This video appears to come from a generally reliable culinary/nutrition channel but has some caveats you should watch for.\n\n- Trust signals: the channel is long-established (since 2012), large audience (1.56M subs, 2.27B views) and produces many recipe and nutrition-type videos — useful for cooking ideas and basic nutrition tips.\n- What I can’t verify: the transcription is empty so I can’t evaluate any specific claims made in this particular video. That means I can only assess risk based on the channel profile and typical content.\n- Main problems to watch for:\n  - Lack of visible professional credentials: nutrition or weight-loss guidance may be simplified or not evidence-based.\n  - Clickbait or overstated claims: titles like “Best…” or celebrity diet takedowns can exaggerate benefits or certainty.\n  - Reposted short clips: snippets can remove context and lead to misleading impressions.\n  - Potential undisclosed sponsorships/affiliate links in product reviews: could bias recommendations.\n- What this channel is unlikely to be: there are no obvious red-flag scams (no investment schemes, miracle cures, or predatory solicitations noted).\n- Practical advice if you rely on the video:\n  - Treat health/weight-loss claims as general guidance and cross-check with registered dietitians, peer‑reviewed research, or major health organizations.\n  - Check the video description and About page for sources, sponsorship disclosures, and the creator’s credentials.\n  - Be cautious following dramatic or prescriptive medical advice from the channel alone; consult a healthcare professional for medical or therapeutic decisions.\n\nBottom line: Good source for recipes and food inspiration, but verify specific nutrition or health claims before acting."
}