{
  "videos/wyKw0gQTs5k": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nVideo risk explanation:\n- The clip is a short-form cooking tutorial from a real creator (El Cook) and shows normal, non-deceptive cooking steps. There is no sign the footage is AI-generated; it appears to be edited human-shot video (fast cuts and jumps common to Shorts). The content does not make verifiably false claims—the “peeling hack” is a legitimate technique (the edit just speeds it up). The rhetorical complaint about fair apple crisp costing $10 is anecdotal and promotional flavor rather than a factual claim that materially misleads.\n\nContext risk explanation:\n- There are no scientific, medical, or political claims taken out of context. The only context users may want is culinary detail: the creator uses rough ingredient cues rather than precise measurements, so if you need an exact recipe you should cross-check with a standard recipe source. Also note the channel is a monetized entertainment/react channel (Patreon, socials) — treat donation/payment requests with the usual caution but this does not affect the video's factual content.\n\nPresentation risk explanation:\n- The video uses high-energy hooks, upbeat music, quick cuts, and expressive delivery to capture attention (typical for Shorts). That styling is mildly clicky but not manipulative in a harmful way. There’s no fear‑selling, ideological push, or deceptive stitching of unrelated footage to claim false events. Overall presentation is entertainment-focused and safe to watch, with the only “misrepresentation” being the accelerated demonstration and casual pricing gripe for dramatic effect.",
  "videos/9qy0bkJIhQU": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Medium\nPresentation Risk: Low\n\nExplanation for video risk rating:\nThis clip is a short-form Pawn Stars segment showing a seller with a Frostmourne replica. It is not AI-generated — it matches a known reality-TV format and appears to be real show footage (edited for drama). The factual elements (identifying the sword as Frostmourne from World of Warcraft and calling it the Lich King’s sword) are correct. The seller’s valuation ($5,000) and the claim that WoW is “the biggest video game of all time” are subjective/sales talk rather than verifiable facts, so they don’t raise a high misinformation risk. For those reasons the overall video risk is low.\n\nExplanation for context risk:\nThe main contextual issue is that reality TV is edited and staged to increase drama; valuations shown on the program are frequently optimized for entertainment and may not reflect actual market prices. The “biggest game” line is hyperbolic and should not be treated as a factual ranking. If you care about authenticity or value, check independent collector markets, auction results, and reputable WoW memorabilia sources. Also note the channel has a large, legitimate audience but a single external payment link — don’t join/pay without verifying the creator’s identity and refund policies.\n\nExplanation for presentation risk:\nThe clip uses fast cuts, bold captions (“WHAT IS THIS?”), zooms, and dramatic music to generate suspense and excitement; that’s standard entertainment editing and can exaggerate perceived value or urgency but isn’t a covert harmful agenda. There’s minor clickbait framing for engagement, but no political, medical, or financial manipulation beyond sales-focused hype.",
  "videos/NSa4uSX71-s": "Mismatch level: Medium\nVideo Risk: Medium\nContext Risk: Medium\nPresentation Risk: High\n\nExplanation for how you got the video risk rating:\nThis appears to be a short-form staged prank rather than an AI-generated deepfake. The dialogue, editing style, and channel patterns point to human-created prank content (POV shots, jump cuts, text overlays). The factual claims in the clip (e.g., “flux capacitor,” “Marty”) are clearly fictional references and not intended as real technical claims, so direct misinformation is low. The risk comes from modeling deceptive social-engineering behavior and normalizing confrontation with authority; that potential for real-world harm raises the overall video risk to medium.\n\nExplanation for context risk:\nKey context is missing: we don’t know if the interaction was staged with a consenting guard, whether the location allowed such behavior, or what consequences (if any) followed. Without that, viewers—especially younger ones—could misinterpret the clip as demonstrating an effective tactic to bypass security. There are no scientific claims or studies being misrepresented, but the omission of staging/context information makes the clip potentially misleading about how easily one can exploit security protocols.\n\nExplanation for presentation risk:\nThe video uses rapid pacing, POV framing, and on-screen text to create an “insider” vibe and make the prank feel triumphant. The channel’s pattern of stunt/prank content and absence of disclaimers encourage imitation and sensational engagement. Clickbait styling and provocation are central to the presentation, increasing the risk that viewers will emulate unsafe or illegal behavior. There’s no visible political or commercial agenda beyond brand building and engagement.",
  "videos/aeNKbL-jSow": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\n[Explanation for how you got the video risk rating (is it AI generated, clips stitched together misleadingly, etc.)]\nThe clip is a short, branded product promo for Adobe Firefly that demonstrates UI elements and generated assets. It appears produced by the company (not itself AI-generated content posing as human-made) and makes straightforward product claims (generate audio, images, video; choose models). Those claims are plausible for an AI creative tool and are supported by the on-screen interface shown; there’s no harmful or technical misinformation. The only minor concern is that the demonstration is edited for brevity and may simplify workflows or omit limits (speed, cost, quality variability), but that’s typical for marketing and doesn’t amount to deceptive fabrication.\n\n[Explanation for context risk (what context do we need to know to understand the video? Are there any scientific studies taken out of context, misrepresentation of facts, etc.)]\nContext to consider: “Access to top AI models” can mean different things — UI integration, links to third-party services, or gateway to APIs — and may require extra subscriptions, different licensing, or usage fees. The video does not discuss costs, terms of service, or copyright/licensing implications of generated assets, so viewers should verify availability and any additional charges or restrictions before assuming full, unrestricted access. There are no scientific claims or data taken out of context.\n\n[Explanation for presentation risk (how is the video presented? Is there music that sets a specific mood, clickbait behavior, fear selling, etc.)]\nThe presentation uses upbeat music, rapid cuts, and high-end visuals to convey efficiency and quality—standard advertising techniques. It’s explicitly commercial and ends with a brand call-to-action. There’s no fear-mongering, clickbait headline, or manipulative claims targeted at vulnerabilities. Viewers should simply be aware it’s promotional and that demos are condensed highlights rather than full step-by-step workflows.",
  "videos/EaDxKdpvMhc": "Mismatch level: High\nVideo Risk: High\nContext Risk: High\nPresentation Risk: High\n\nVideo risk explanation:\nThe clip uses AI-generated audio (a voice clone) laid over real footage to fabricate a speech that never happened — including a false premise that the speaker is President. It contains explicit hateful language and demeaning attacks targeted at children and protected groups. Those facts make it a deepfake/misinformation piece with high potential to mislead viewers unfamiliar with the real record.\n\nContext risk explanation:\nUnderstanding this video requires knowing that RFK Jr. (the person depicted) has not been inaugurated as President and that the quoted lines are fabricated. The video compresses and distorts real topics (e.g., discussions about “seed oils” or SSRIs) into an extreme, decontextualized rant. The channel is small, clickbait-driven, and lacks sourcing or credentials, increasing the chance the content is satire or malicious disinformation rather than factual reporting.\n\nPresentation risk explanation:\nThe video is presented for shock/engagement: low-production, POV/text-overlay clickbait style, offensive language, and meme aesthetics designed to provoke outrage. The AI voice, coarse humor, and sensational framing are intended to attract shares and anger rather than inform — treat it as fabricated entertainment and verify any claims with reputable sources before trusting or sharing.",
  "videos/fr9WBk-JC4E": "Mismatch level: Low\nVideo Risk: Low\nContext Risk: Low\nPresentation Risk: Low\n\nExplanation for video risk:\n- This video appears to be real, on-location footage of people dancing in Old San Juan to salsa music (no signs of AI generation, deepfakes, or deceptive splicing). \n- It makes only subjective, nostalgic claims (valuing an experience), not factual assertions about health, science, or finance, so it poses minimal misinformation or safety risk.\n\nExplanation for context risk:\n- The clip is cultural/lifestyle content and does not rely on or misrepresent scientific studies or expert claims. Context needed to understand it is simply that it’s a personal memory/celebration of a moment in Puerto Rico. \n- Caveat: the channel that posted this has a broader pattern of promoting unverified metaphysical and “manifestation” claims and links to paid products. For this specific video that channel history doesn’t change the low risk, but don’t treat the channel itself as a reliable source for medical, financial, or scientific advice.\n\nExplanation for presentation risk:\n- The video uses upbeat music and nostalgic text to create emotional resonance (FOMO/carpe diem), which is normal for travel/lifestyle shorts and not manipulative in a harmful way. \n- There’s no explicit product placement or hard-sell in this clip; the only subtle “agenda” is promoting the value of experiences and local culture. If you see linked products on the channel, verify reviews and refund policies before engaging.",
  "videos/QaBmK0Rs7cA": "Mismatch level: Medium\nVideo Risk: Low\nContext Risk: High\nPresentation Risk: Medium\n\nExplanation for video risk rating:\n- The clip itself is a straightforward lifestyle/demo of manually juicing pomegranates. The on-screen claims (showing a bottle priced at about $17 and comparing DIY yield to retail) are plausible and limited to personal experience. There are no medical or scientific claims, no obvious splice-based deception, and nothing that looks AI-generated (the footage shows natural camera movement and human reaction). For those reasons the direct risk from the video's content is low.\n\nExplanation for context risk:\n- The channel and account metadata are highly suspicious: the channel name contains a phone number, it has almost no metadata or history, very few subscribers, and appears to be a throwaway or ad-hosting account. That raises a higher contextual risk because such accounts are often used for spam, scams, or to host promotional content that links outside the platform. Even though the video content is benign, the origin increases the chance the video is part of a promotional or spam campaign or could be used to funnel people off-platform. Treat contact details in the channel title as untrusted.\n\nExplanation for presentation risk:\n- The video uses high-energy short-form editing and enthusiastic reactions, which are standard for engagement-driven clips. That editing style is not inherently deceptive, but combined with the suspicious channel branding (phone number in the title), presentation has a medium risk: it could be intended to attract attention and then direct viewers to off-platform contact or sales. There is no fear-mongering, explicit clickbait claims, or ideological messaging in the clip itself.\n\nBottom-line actionable points:\n- AI-generated? Very unlikely — this appears to be normal recorded footage, not synthetic content.\n- Contains misinformation? No significant misinformation detected in the content itself.\n- Promotes an agenda? The video does not push an ideological agenda, but the channel’s presentation (phone number in title, little transparency) suggests a promotional or spam intent. Do not call the number or share personal information. If you suspect a scam, search the phone number and channel externally and consider reporting the channel to YouTube.",
  "videos/Wk6eAZJf4rU": "Mismatch level: Low\nVideo Risk: Medium\nContext Risk: Medium\nPresentation Risk: Medium\n\nExplanation for how you got the video risk rating:\n- The clip is a short, inhaled retelling of a well-known parable (two babies in the womb), not a report of verifiable facts or data. There’s no clear sign it was AI‑generated; it appears to be a repackaged short from a spoken source (podcast/clip). \n- Because it uses that parable to suggest the plausibility of an afterlife, it risks misleading viewers who treat the analogy as evidence. The channel’s pattern of short, sensational clips and repackaging raises the chance the same kind of content is repeatedly used to drive engagement rather than inform, so overall risk is medium.\n\nExplanation for context risk:\n- The video presents a literary metaphor as a rhetorical proof. To evaluate the claim (life after death) you need philosophical or scientific context; the clip offers none. That absence makes the content easy to misinterpret as argument-based evidence when it isn’t.\n- There are no citations, experts, or sources. Given the channel’s low-to-moderate trust profile (repackaged shorts, clickbait metadata), the broader context is that these clips are meant to promote a larger brand/podcast rather than provide sourced analysis.\n\nExplanation for presentation risk:\n- The short uses standard attention-driving tools (dramatic music, close-up cuts, highlighted captions and a strong hook) that emotionally prime viewers to accept the message. That framing creates a false sense of authority for what is effectively a parable.\n- Titles/metadata practices on the channel suggest clickbait/piggybacking behavior; while not overtly harmful, the presentation pushes a spiritual/faith-affirming agenda without making clear it’s promotional or interpretive rather than evidentiary.\n\nBottom line: The video is not likely AI‑generated and contains no overt factual falsehoods, but it uses a literary analogy presented in a persuasive way that can be misconstrued as evidence for metaphysical claims. Treat it as a spiritual reflection or promotional clip and not as proof of an afterlife."
}